[
  {
    "planId": "time-efficient-strength-conditioning",
    "weekNumber": 1,
    "metadata": {
      "title": "Time-Constrained Week 1 — Foundation Phase Start",
      "phase": "Weeks 1-2: Foundation",
      "progressionFocus": "Learn superset technique, establish baseline strength, build work capacity with 60-65% loads @ RPE 6-7",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 1 — Foundation Phase. Welcome to time-efficient training. This week is about learning to transition quickly between exercises with minimal rest while maintaining movement quality. You'll perform 3 full-body workouts using supersets—pairing two exercises with minimal transition time (<15sec between exercises in a superset, 60-90sec rest between supersets). Loads are moderate (60-65% estimated 1RM, RPE 6-7—leave 3-4 reps in reserve) to allow focus on pacing and form. Each session contains 3 supersets of compound movements, taking 30-35 minutes. The key this week: master the transitions. Don't rush through exercises, but move deliberately between them. If you're gasping for air or form breaks down significantly, you're moving too fast—extend rest to 2min and dial back intensity. Cardio finishers are optional—only add if you have time and energy after the main work. Track your transition times and loads used; this baseline will inform future progression. Most importantly, this week establishes the habit: 3 focused sessions per week, non-consecutive days (Mon/Wed/Fri recommended but flexible). You'll likely feel cardiovascular fatigue more than muscular fatigue this week—that's normal when learning density training. Sleep 7-8 hours per night, eat at maintenance calories, and hydrate well. By Week 2, your body will adapt to the short rest periods.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday or your first training day) — Full Body A: Push Emphasis. Warm-up (5-10min): Light cardio (bike, row, or jog) until you break a light sweat, then dynamic stretching (leg swings, arm circles, bodyweight squats, push-ups). The goal is to elevate heart rate and prepare joints—don't skip this. Superset 1 (3 sets): Goblet Squat 3×10-12 @ RPE 6-7 (hold dumbbell at chest, descend to parallel or below, 2sec down, 1sec pause, explosive up) + Push-ups 3×8-12 @ RPE 6-7 (hands slightly wider than shoulders, descend to chest, push explosively; if bodyweight is too easy, elevate feet on bench; if too hard, use incline or knee push-ups). Rest 60-90sec after completing both exercises. Transition time goal: <15sec from finishing squats to starting push-ups. Superset 2 (3 sets): Dumbbell Romanian Deadlift (RDL) 3×10-12 @ RPE 6-7 (hinge at hips, push hips back, feel hamstring stretch as dumbbells travel to mid-shin, squeeze glutes to return, don't round back) + Dumbbell Shoulder Press 3×8-10 @ RPE 6-7 (standing or seated, press dumbbells overhead, lockout fully but don't hyperextend, control descent). Rest 60-90sec. Superset 3 (3 sets): Dumbbell Row 3×10/arm @ RPE 6-7 (single-arm supported on bench, pull dumbbell to hip, squeeze shoulder blade back, control descent) + Plank 3×30-45sec (forearms on ground, body straight from head to heels, engage core and glutes, don't let hips sag). Rest 60-90sec. Optional Cardio Finisher (if time/energy allows): 5min row intervals—8 rounds of 20sec hard (RPE 8), 40sec easy (RPE 4). Cooldown: 5min light stretching (quads, hamstrings, chest, shoulders). Session time: ~30-35min (excluding finisher). Notes: Focus on movement quality and transition speed. Track loads used and how the pacing felt. If you maintained <90sec rest between supersets and all exercises felt RPE 6-7, weights are appropriate.",
        "Day 2 (Tuesday or rest day) — Rest or Active Recovery. This is a non-training day. Your body is adapting to density training—short rest periods create metabolic stress and cardiovascular demand beyond traditional strength training. Options: (A) Complete rest—sleep, work, live your life. (B) Light activity—15-20min easy walk (conversational pace), gentle yoga, or mobility work (focus on hips, shoulders, ankles). Do NOT lift weights or do intense cardio. Recovery priorities: Sleep 7-8 hours, eat at maintenance calories (don't cut calories just because you didn't train—recovery requires energy), hydrate (half your bodyweight in oz of water), manage stress (training is a stressor—balance it with relaxation). Reflect: How did Day 1 feel? Were transitions smooth (<15sec)? Did you maintain 60-90sec rest between supersets, or did you need longer? Any exercises that felt awkward or too hard/easy? Adjust loads for Day 3 if needed.",
        "Day 3 (Wednesday or your second training day) — Full Body B: Pull Emphasis. Warm-up (5-10min): Same as Day 1—light cardio + dynamic stretching. Superset 1 (3 sets): Barbell Deadlift 3×8-10 @ RPE 6-7 (conventional or sumo stance, bar over mid-foot, chest up, lats engaged, push floor away with legs, bar scrapes shins/thighs, lockout with glutes; this is lighter than you'd normally deadlift—focus on bar speed and form) + Pull-ups OR Lat Pulldown 3×6-10 @ RPE 6-7 (pull-ups: if you can do 6+ clean reps, use bodyweight; if not, use assisted pull-up machine or lat pulldown; pull elbows down, squeeze lats at bottom). Rest 60-90sec. Superset 2 (3 sets): Goblet Squat 3×10-12 @ RPE 6-7 (same as Day 1, may use slightly heavier dumbbell if Day 1 felt easy) + Dumbbell Bench Press 3×8-10 @ RPE 6-7 (lie on flat bench, press dumbbells up and slightly together, control descent to chest level, don't bounce). Rest 60-90sec. Superset 3 (3 sets): Dumbbell RDL 3×10-12 @ RPE 6-7 (same as Day 1) + Dumbbell Curls 3×10-12 @ RPE 6-7 (standing, curl dumbbells to shoulder height, squeeze biceps at top, control descent, strict form—no swinging). Rest 60-90sec. Optional Cardio Finisher: 5min jump rope—5 rounds of 1min on (moderate pace, focus on rhythm), 30sec off. Cooldown: 5min stretching. Session time: ~30-35min. Notes: Pull emphasis today (deadlifts, pull-ups/pulldowns primary). Compare transition times and rest periods to Day 1—are you getting faster/more efficient?",
        "Day 4 (Thursday or rest day) — Rest or Active Recovery. Same guidance as Day 2. Your body is accumulating training stress from 2 sessions in 3 days (Mon & Wed). Rest days are when adaptation happens—muscles repair, cardiovascular system strengthens, nervous system recovers. Don't feel guilty about not training—you're not lazy, you're following the program. If you feel restless, do 15-20min easy walking or light mobility work. Prioritize sleep and nutrition. Reflect: How did Day 3 compare to Day 1? Deadlifts felt heavy or manageable? Pull-ups/pulldowns smooth? Adjust loads for Day 5 (Friday) if needed—if both Day 1 and Day 3 felt RPE 6 (too easy), add 5-10lbs to main compounds; if RPE 7.5-8 (too hard), reduce 5lbs.",
        "Day 5 (Friday or your third training day) — Full Body C: Lower Emphasis. Warm-up (5-10min): Light cardio + dynamic stretching. Superset 1 (3 sets): Front Squat OR Goblet Squat 3×8-10 @ RPE 6-7 (front squat if comfortable with barbell, otherwise goblet squat; front squat: bar on front delts, elbows high, chest up, descend to parallel or below; goblet: same as Days 1 & 3) + Dumbbell Bench Press 3×8-10 @ RPE 6-7 (same as Day 3). Rest 60-90sec. Superset 2 (3 sets): Barbell RDL 3×10-12 @ RPE 6-7 (same hinge pattern as dumbbell RDL but with barbell, allows heavier load; hinge at hips, bar travels down shins to mid-shin, feel hamstring stretch, squeeze glutes to return) + Dumbbell Row (both arms) 3×10/arm @ RPE 6-7 (bent-over position, row dumbbells to hips, squeeze shoulder blades together). Rest 60-90sec. Superset 3 (3 sets): Walking Lunges 3×10/leg @ RPE 6-7 (hold dumbbells at sides, step forward into lunge—front thigh parallel to ground, back knee nearly touches floor—push through front heel to step forward into next lunge; 10 total steps per leg = 20 steps total per set) + Dumbbell Overhead Press 3×8-10 @ RPE 6-7 (same as Day 1). Rest 60-90sec. Optional Cardio Finisher: 5min hill sprints—6 sprints of 10-15sec (find a hill or set treadmill to 8-10% incline, sprint hard uphill, walk back down for recovery). Cooldown: 5min stretching. Session time: ~30-35min. Notes: Lower emphasis today (front squat, RDL, lunges primary). You've completed 3 full-body sessions this week—each major movement pattern (squat, hinge, push, pull) trained 3 times. Cardiovascular conditioning improved from short rest periods. Reflect: Compare Week 1 to your previous training (if any)—did you get more work done in less time? How does your energy feel despite shorter sessions?",
        "Day 6 (Saturday) — Rest. Complete rest after 3 training days (Mon/Wed/Fri). You've accumulated significant training stress from density work—short rest periods create metabolic fatigue even with moderate loads. Saturday is recovery day. Options: Light walking (15-20min), gentle yoga, or complete rest. Do NOT train. Sleep 7-8 hours tonight. Eat at maintenance. Hydrate. Enjoy your weekend—training doesn't have to consume your life. Reflect: How did Week 1 go overall? Did you maintain the 3-session schedule? Transition times improving? Any exercises need load adjustments for Week 2? Are you feeling more energized despite busy schedule, or more fatigued? Week 1 is about establishing the habit and learning the technique—don't worry if weights felt light or you didn't feel 'worked'. The intensity will increase in Weeks 3-6.",
        "Day 7 (Sunday) — Rest. Full rest or very light activity (walking, mobility work). This is the end of Week 1. You've completed the foundation: 3 full-body sessions, 9 supersets total, ~100 reps of compound work, ~90-105min of training (excluding finishers and warm-ups). Week 1 is complete. Assess: Did you hit all 3 sessions? How did the pacing feel (60-90sec rest between supersets)? Transition times (<15sec within supersets)? Any soreness (normal but should be manageable)? Week 2 continues Foundation phase—same structure, potentially slightly heavier loads if Week 1 felt easy (RPE 6). Week 3 begins Progressive Overload—loads increase to 70-75% (RPE 7-8), and you'll start adding weight or reps each week. Prepare mentally: this program is about consistency over perfection. If you miss a session, don't double up—just continue the sequence. If life gets busy and you can only do 2 sessions one week, that's okay—do Day 1 and Day 3, skip Day 2. The key is showing up regularly, not being perfect. You've got this. See you Week 2."
      ]
    }
  },
  {
    "planId": "time-efficient-strength-conditioning",
    "weekNumber": 4,
    "metadata": {
      "title": "Time-Constrained Week 4 — Progressive Overload Mid-Phase",
      "phase": "Weeks 3-6: Progressive Overload",
      "progressionFocus": "Increase load and volume systematically with 70-75% loads @ RPE 7-8, add 5-10lbs to compounds or 1-2 reps per set",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 4 — Progressive Overload Phase (Mid-Phase). You're halfway through the Progressive Overload block (Weeks 3-6). By now, you should be comfortable with superset pacing and short rest periods. Loads have increased to 70-75% estimated 1RM (RPE 7-8—leave 2-3 reps in reserve), and session times have extended to 35-40 minutes. This week, continue adding weight or reps: if you completed all prescribed reps last week at RPE 7-8, add 5-10lbs to main compounds (squat, deadlift, bench, press) or add 1-2 reps per set for accessories. If you failed to complete reps for 2 consecutive sessions, reduce weight by 10% and rebuild. Cardiovascular fitness should be noticeably improved—60-90sec rest feels manageable now, whereas Week 1 it felt rushed. Work capacity is increasing—you're getting more work done in the same time window. Some advanced trainees may add a 4th superset this week if time/energy allows, but it's optional—3 supersets (9 sets total) is sufficient for most. Focus this week: progressive overload. Track every set—weight, reps completed, RPE. Compare to Week 3: are you lifting heavier or performing more reps? That's progress. Sleep 7-8 hours, eat at maintenance or slight surplus (200-300 cal above maintenance to support strength gains), prioritize protein (0.8-1g per lb bodyweight). Optional cardio finishers are still available but not required—if you're fatigued from work/life stress, skip them. The main supersets are the priority. You're building momentum—Weeks 5-6 will continue this progression before Week 7's peak test.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday or first training day) — Full Body A: Push Emphasis. Warm-up (5-10min): Light cardio + dynamic stretching. Your warm-up should feel routine by now—don't skip it. Superset 1 (3 sets): Barbell Back Squat 3×8-10 @ RPE 7-8 (70-75% estimated 1RM; if Week 3 you squatted 135lbs×10 @ RPE 7, this week try 145lbs×10 or 135lbs×12; bar on traps or rear delts depending on preference, descend to parallel or below, 2-3sec down, drive explosively up) + Push-ups 3×10-15 @ RPE 7-8 (if bodyweight push-ups are too easy—meaning you can do 20+ reps—add weight via backpack with plates, or elevate feet on bench; aim for RPE 7-8, leaving 2-3 reps in reserve). Rest 60-90sec. Transition: <15sec. Superset 2 (3 sets): Barbell Deadlift 3×6-8 @ RPE 7-8 (if Week 3 you pulled 185lbs×8 @ RPE 7, try 205lbs×8 or 185lbs×10; conventional or sumo, perfect setup every rep—bar over mid-foot, chest up, lats engaged, push floor away) + Dumbbell Shoulder Press 3×8-10 @ RPE 7-8 (standing or seated, press overhead, lockout fully, control descent; if Week 3 you used 30lb dumbbells×10, try 35lb×10 or 30lb×12). Rest 60-90sec. Superset 3 (3 sets): Chest-Supported Row OR Dumbbell Row 3×10-12/arm @ RPE 7-8 (if you have access to chest-supported row machine, use it—eliminates lower back fatigue and allows focus on back; otherwise dumbbell rows work great; pull to hip, squeeze shoulder blade back) + Plank 3×45-60sec (increase duration from Week 1's 30-45sec; maintain perfect form—if hips sag, end set). Rest 60-90sec. Optional 4th Superset (advanced trainees): Goblet Squat 2×12-15 @ RPE 7-8 + Dumbbell Chest Flyes 2×12-15 @ RPE 7-8 (only add if you have time and energy—session should stay under 45min including warm-up). Optional Cardio Finisher: 8min assault bike—10 rounds of 15sec sprint (RPE 9), 45sec easy (RPE 4). Cooldown: 5min stretching. Session time: ~35-40min (or ~45min if you add 4th superset). Notes: Progressive overload in action—compare loads to Week 3. Are you lifting 5-10lbs heavier or doing 1-2 more reps per set? Track everything.",
        "Day 2 (Tuesday or rest day) — Rest or Active Recovery. Same rest day protocol as Week 1, but your recovery demands are higher now (heavier loads, RPE 7-8 vs RPE 6-7). Prioritize sleep—aim for 8 hours if possible. Nutrition: eat at maintenance or slight surplus (200-300 cal above maintenance). Post-Day 1 soreness is normal, especially if you increased loads significantly—don't panic. Delayed onset muscle soreness (DOMS) peaks 24-48hr after training and resolves by Day 3-4. If you're extremely sore, light walking (15-20min) can help flush metabolic waste and reduce stiffness. Do NOT train today. Reflect: How did Day 1 loads feel compared to Week 3? Did you successfully add weight or reps? Any exercises that felt particularly hard (may need smaller jumps next time)?",
        "Day 3 (Wednesday or second training day) — Full Body B: Pull Emphasis. Warm-up (5-10min). Superset 1 (3 sets): Barbell Deadlift 3×6-8 @ RPE 7-8 (if you deadlifted on Day 1, you're deadlifting again today—this is time-efficient full-body training; loads may be slightly lighter than Day 1 due to accumulated fatigue, and that's fine; focus on bar speed and form) + Pull-ups OR Lat Pulldown 3×6-10 @ RPE 7-8 (if Week 3 you did 8 bodyweight pull-ups, try adding 5-10lbs via weight belt, or aim for 10 reps bodyweight; if using lat pulldown and you did 100lbs×10, try 110lbs×10 or 100lbs×12). Rest 60-90sec. Superset 2 (3 sets): Goblet Squat OR Front Squat 3×10-12 @ RPE 7-8 (goblet squat: if Week 3 you used 50lb dumbbell×12, try 55lb×12 or 50lb×15; front squat: if you've progressed to barbell, same progression logic—add 5-10lbs or 1-2 reps) + Dumbbell Bench Press 3×8-10 @ RPE 7-8 (if Week 3 you used 50lb dumbbells×10, try 55lb×10 or 50lb×12). Rest 60-90sec. Superset 3 (3 sets): Dumbbell RDL 3×10-12 @ RPE 7-8 + Dumbbell Curls 3×10-12 @ RPE 7-8 (progressive overload applies to accessories too—add 2.5-5lbs to RDLs and curls if Week 3 felt easy). Rest 60-90sec. Optional Cardio Finisher: 6min burpees—5 rounds of 10 burpees (chest to ground, jump to stand), rest 30sec between rounds. Cooldown: 5min stretching. Session time: ~35-40min. Notes: Pull emphasis. Deadlifts twice per week (Day 1 & Day 3) builds work capacity without excessive volume per session. Compare loads to Week 3 Day 3—progressive overload check.",
        "Day 4 (Thursday or rest day) — Rest or Active Recovery. You've trained Mon & Wed—2 sessions done, 1 to go. Thursday rest is critical. Loads are heavier (70-75% vs 60-65% in Week 1), and RPE is higher (7-8 vs 6-7). Your nervous system and muscles need recovery. Sleep 7-8 hours. Eat at maintenance or slight surplus. Hydrate. If you're feeling run-down or sleep-deprived, consider skipping Friday's cardio finisher—the main supersets are the priority, finishers are optional. Reflect: How's Week 4 going compared to Week 3? Are you successfully adding weight or reps? Energy levels good or fatigued? Week 5-6 will continue this progression, so pace yourself—don't add too much weight too fast (recipe for injury or burnout).",
        "Day 5 (Friday or third training day) — Full Body C: Lower Emphasis. Warm-up (5-10min). Superset 1 (3 sets): Front Squat OR Barbell Back Squat 3×8-10 @ RPE 7-8 (if you did back squat on Day 1, consider front squat here for variation; if you've been doing goblet squats, this is a good week to try barbell front squat; progression logic: add 5-10lbs or 1-2 reps from Week 3) + Dumbbell Bench Press 3×8-10 @ RPE 7-8. Rest 60-90sec. Superset 2 (3 sets): Barbell RDL 3×10-12 @ RPE 7-8 (if Week 3 you did 95lbs×12, try 115lbs×12 or 95lbs×15; hinge pattern should feel natural by now—focus on hamstring stretch and glute contraction) + Dumbbell Row OR Barbell Row 3×10/arm @ RPE 7-8 (if using barbell row instead of dumbbell, that's fine—pull to sternum, squeeze shoulder blades). Rest 60-90sec. Superset 3 (3 sets): Walking Lunges 3×10-12/leg @ RPE 7-8 (hold heavier dumbbells than Week 3—if you used 20lb dumbbells, try 25lb or 30lb; lunge pattern should be controlled—no wobbling or knee caving inward) + Dumbbell Overhead Press 3×8-10 @ RPE 7-8. Rest 60-90sec. Optional Cardio Finisher: 8min farmer carries—4 rounds of 40-50 yards with heavy dumbbells or kettlebells (pick weight that's challenging to hold but you can walk without stopping; rest 90sec between rounds). Cooldown: 5min stretching. Session time: ~35-40min. Notes: Lower emphasis. You've now trained 3 full-body sessions this week with heavier loads than Week 3. Progressive overload complete. Compare Week 4 totals to Week 3 totals—are you lifting 5-10% more across the board? That's the goal.",
        "Day 6 (Saturday) — Rest. Complete rest after 3 progressive overload sessions. You've accumulated more training stress than Week 1 or Week 2 (heavier loads, same short rest periods). Sleep is critical—aim for 8 hours. Nutrition: maintain or slight surplus. Hydrate. Enjoy your weekend. Reflect: Week 4 complete. How did progressive overload go? Were you able to add weight or reps consistently, or did some exercises plateau? If you plateaued on an exercise (e.g., couldn't add weight to pull-ups), that's fine—try adding 1-2 reps instead, or accept that some weeks you maintain and progress the following week. Progressive overload isn't linear—you won't add weight every single week forever. The goal is trend progression (compare Week 4 to Week 1—are you significantly stronger? Yes.). Weeks 5-6 continue this block, then Week 7 tests your peak strength, and Week 8 is a well-earned deload.",
        "Day 7 (Sunday) — Rest. Full rest or light activity. Week 4 is done. You're 50% through the program (Week 4 of 8). Assess: Are you feeling stronger? More conditioned? Sessions still taking 35-40min or creeping longer (if longer, you're resting too much between supersets—tighten rest to 60-90sec)? Energy levels good despite busy schedule? Mental state—do you feel accomplished after sessions, or stressed? If stressed, consider dropping cardio finishers for Weeks 5-6. Prepare for Week 5: continue progressive overload (add weight or reps), maintain superset pacing, prioritize sleep and nutrition. Week 7 will be a peak week (75-80% loads, RPE 8-9)—you'll test what you can handle for 8-10 reps on main lifts. Week 8 is a deload (40% volume reduction, lighter loads, active recovery). You're on track. Keep showing up."
      ]
    }
  },
  {
    "planId": "time-efficient-strength-conditioning",
    "weekNumber": 6,
    "metadata": {
      "title": "Time-Constrained Week 6 — Progressive Overload Final Week",
      "phase": "Weeks 3-6: Progressive Overload",
      "progressionFocus": "Final week of progressive overload before Week 7 peak test, 70-75% loads @ RPE 7-8, push for max progression",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 6 — Progressive Overload Phase (Final Week Before Peak). This is the last week of the Progressive Overload block (Weeks 3-6) before Week 7's peak test. You've been adding weight or reps consistently for the past 3 weeks—Week 6 is your final chance to push progression before testing. Loads remain 70-75% estimated 1RM (RPE 7-8), but by now you should be handling significantly more weight than Week 3. Session times are 35-40 minutes (potentially 40-45 if you've added a 4th superset). This week, aim for the upper end of rep ranges or slightly heavier loads—if you've been doing 3×8-10 on squats, try to hit 3×10 or add 5lbs and maintain 3×8. The goal is to enter Week 7 with confidence: you've built strength and work capacity over 4 weeks, and Week 7 will test it. Week 8 is a scheduled deload (40% volume reduction, 60-70% loads, RPE 6-7, no finishers)—so don't worry about pushing hard this week and next; you'll get a recovery week to dissipate fatigue. Sleep 7-8 hours minimum (8 preferred), eat at maintenance or slight surplus (you're still building strength), prioritize protein (0.8-1g per lb), and hydrate well. Mental preparation: Week 7 will feel challenging (75-80% loads, RPE 8-9)—that's the point. It's a peak week to see how much you've progressed. Then Week 8 you'll actively recover and assess whether to repeat the 8-week program with heavier starting weights, add advanced techniques, or transition to a more specialized program. Week 6 is about finishing strong—make every rep count, maintain perfect form, and track everything.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday or first training day) — Full Body A: Push Emphasis. Warm-up (5-10min): By Week 6, your warm-up should be efficient and thorough—light cardio until light sweat, dynamic stretching (leg swings, arm circles, bodyweight squats). Don't skimp; you're about to lift heavier than Week 5. Superset 1 (3 sets): Barbell Back Squat 3×8-10 @ RPE 7-8 (70-75% estimated 1RM; if Week 5 you squatted 155lbs×10 @ RPE 7-8, this week try 165lbs×10 or 155lbs×12; focus: bar speed on ascent—if rep 10 is a grind, you're at your limit; if rep 10 feels like you have 2-3 more in the tank, perfect RPE) + Push-ups 3×12-15 @ RPE 7-8 (weighted if needed to hit RPE; if bodyweight is still challenging, aim for 15 clean reps per set). Rest 60-90sec. Transition: <15sec between exercises. Superset 2 (3 sets): Barbell Deadlift 3×6-8 @ RPE 7-8 (if Week 5 you pulled 225lbs×8 @ RPE 7-8, try 235lbs×8 or 225lbs×10; this is your final progressive overload deadlift session before Week 7's heavier test—make it count; perfect setup every rep, bar speed fast off floor, lockout controlled) + Dumbbell Shoulder Press 3×8-10 @ RPE 7-8 (if Week 5 you pressed 40lb dumbbells×10, try 45lb×10 or 40lb×12; standing preferred for core engagement, but seated is fine if fatigued). Rest 60-90sec. Superset 3 (3 sets): Chest-Supported Row OR Dumbbell Row 3×10-12/arm @ RPE 7-8 (focus on squeeze at contraction—this is back thickness work) + Plank 3×60sec (if you can hold perfect form for 60sec, add weight to your back—plate or weighted vest; if form breaks before 60sec, that's fine—end set). Rest 60-90sec. Optional 4th Superset (if time/energy): Goblet Squat 2×15 @ RPE 7-8 + Dumbbell Chest Flyes 2×12-15 @ RPE 7-8 (only add if you're feeling strong; this week is about quality over quantity). Optional Cardio Finisher: 10min row intervals—8 rounds of 30sec hard (RPE 8-9), 90sec easy (RPE 4). Cooldown: 5min stretching (focus on quads, hamstrings, chest, shoulders—you'll want to be recovered for Day 3). Session time: ~35-40min (or 45min with 4th superset). Notes: Final progressive overload session for squats and deadlifts before Week 7 peak. Track loads used—you'll compare these to Week 7 heavier loads. How does RPE 7-8 feel now compared to Week 3? It should feel more sustainable (work capacity improved).",
        "Day 2 (Tuesday or rest day) — Rest or Active Recovery. Week 6 rest days are extra important—you're at peak training stress for the Progressive Overload block. Your muscles, joints, and nervous system need recovery to perform well on Day 3 and Day 5. Sleep 8 hours if possible. Nutrition: eat at maintenance or slight surplus, prioritize protein (post-Day 1 muscle protein synthesis is happening—feed it). Hydration: half your bodyweight in oz of water. Optional light activity: 15-20min easy walk, gentle yoga, or foam rolling (quads, hamstrings, glutes, upper back). Do NOT lift or do intense cardio. Reflect: Day 1 loads—did you push progression successfully, or did you plateau on some exercises? If you plateaued, that's normal after 4 weeks of continuous progression. Week 8 deload will reset you, and you can start the next block stronger. Mental check-in: how's your energy? Motivated for Week 7's peak test, or feeling burnt out? If burnt out, skip cardio finishers this week and next—focus on the main supersets only.",
        "Day 3 (Wednesday or second training day) — Full Body B: Pull Emphasis. Warm-up (5-10min). Superset 1 (3 sets): Barbell Deadlift 3×6-8 @ RPE 7-8 (second deadlift session this week; loads may be slightly lighter than Day 1 due to fatigue—that's expected; focus on form and bar speed; if Day 1 you pulled 235lbs×8, today maybe 225lbs×8 feels like RPE 7-8 due to accumulated fatigue) + Pull-ups OR Lat Pulldown 3×6-10 @ RPE 7-8 (if Week 5 you did 10 bodyweight pull-ups, try adding 10lbs via weight belt and aim for 8 reps; if using lat pulldown and you did 120lbs×10, try 130lbs×10 or 120lbs×12). Rest 60-90sec. Superset 2 (3 sets): Front Squat OR Goblet Squat 3×10-12 @ RPE 7-8 (if you've transitioned to front squat, continue adding weight; if still goblet, same logic—heavier dumbbell or more reps) + Dumbbell Bench Press 3×8-10 @ RPE 7-8 (if Week 5 you used 60lb dumbbells×10, try 65lb×10 or 60lb×12). Rest 60-90sec. Superset 3 (3 sets): Dumbbell RDL 3×10-12 @ RPE 7-8 + Dumbbell Curls 3×10-12 @ RPE 7-8 (final progressive overload session for RDLs and curls before peak week—push for max reps or slightly heavier dumbbells). Rest 60-90sec. Optional Cardio Finisher: 5min burpees—5 rounds of 10 burpees, rest 30sec between rounds (this is conditioning, not strength—only do if you have energy). Cooldown: 5min stretching. Session time: ~35-40min. Notes: Pull emphasis, second deadlift session. Compare to Week 5 Day 3—progressive overload check. How's your pull-up strength? Back thickness from rows improving?",
        "Day 4 (Thursday or rest day) — Rest or Active Recovery. You've completed 2 of 3 sessions for Week 6. Friday's session (Day 5) is your last progressive overload workout before Week 7's peak test. Rest well today. Sleep 8 hours. Eat well. Hydrate. Mental preparation for Day 5: it's the final push before peak week—give it your best effort, but don't grind reps to failure (RPE 7-8, not RPE 10). Week 7 is where you'll test limits; Week 6 is about setting up Week 7 for success. Reflect: How's Week 6 going? Are you still making small progressions (adding weight or reps), or have you plateaued? Plateau is normal after 4 weeks—Week 8 deload will allow supercompensation, and you'll come back stronger in the next block. If you're feeling very fatigued, consider skipping Friday's cardio finisher—the main supersets are what matter.",
        "Day 5 (Friday or third training day) — Full Body C: Lower Emphasis. Warm-up (5-10min). This is your final progressive overload session before Week 7's peak. Make it count. Superset 1 (3 sets): Front Squat OR Barbell Back Squat 3×8-10 @ RPE 7-8 (if Day 1 you did back squat, consider front squat here; if you've been alternating, continue that pattern; progression: add 5-10lbs or aim for 2 more reps than Week 5; this is the last time you'll squat at RPE 7-8 before Week 7's RPE 8-9 test—visualize success before each set) + Dumbbell Bench Press 3×8-10 @ RPE 7-8 (third bench press session this week—loads may be slightly lighter due to fatigue; that's fine; focus on control and full ROM). Rest 60-90sec. Superset 2 (3 sets): Barbell RDL 3×10-12 @ RPE 7-8 (if Week 5 you did 135lbs×12, try 145lbs×12 or 135lbs×15; hinge pattern is locked in by now—focus on hamstring stretch and explosive hip extension) + Barbell Row OR Dumbbell Row 3×10-12 @ RPE 7-8 (pull to sternum, squeeze shoulder blades, control descent). Rest 60-90sec. Superset 3 (3 sets): Walking Lunges 3×12/leg @ RPE 7-8 (heavier dumbbells than Week 5; if you used 30lb dumbbells, try 35lb; 12 steps per leg = 24 total steps per set—your legs should be burning by the end) + Dumbbell Overhead Press 3×8-10 @ RPE 7-8 (final overhead press at RPE 7-8 before Week 7's heavier test). Rest 60-90sec. Optional Cardio Finisher: 10min farmer carries—4 rounds of 50 yards with very heavy dumbbells or kettlebells (this is grip and core endurance; rest 2min between rounds). Cooldown: 5min stretching (extra focus on legs—quads, hamstrings, glutes, calves). Session time: ~35-40min. Notes: Lower emphasis. Week 6 complete after this session. Compare loads to Week 5 Day 5 and Week 3 Day 5—how much have you progressed over 4 weeks? That's the real metric.",
        "Day 6 (Saturday) — Rest. Complete rest after completing Week 6's 3 training sessions. You've accumulated 4 weeks of progressive overload—loads have increased by 10-20% (or reps increased by 10-20%), work capacity has improved significantly (60-90sec rest feels normal now, whereas Week 1 it felt rushed), and cardiovascular fitness is noticeably better. Sleep 8 hours. Eat at maintenance or slight surplus. Hydrate. Reflect: Week 6 complete. How do you feel physically (strong? fatigued? sore?) and mentally (motivated for Week 7? burnt out?)? Compare Week 6 loads to Week 3 loads across all exercises—calculate percentage increase. Typical progression: 10-20% increase in 4 weeks on main lifts (squat, deadlift, bench, press), 15-25% increase in reps on bodyweight exercises (push-ups, pull-ups, planks). If you're in that range, you're on track. Prepare for Week 7: next week, loads increase to 75-80% estimated 1RM (RPE 8-9). You'll test what you can handle for 8-10 reps on main compounds—this is a peak week to see your progress. Then Week 8 is a well-earned deload (40% volume reduction, 60-70% loads, RPE 6-7, no finishers). After Week 8, you'll assess: repeat the 8-week program with 10-20% heavier starting weights, add advanced techniques (rest-pause, drop sets), or transition to a more specialized program (4-day upper/lower if you gain more time). You've built a strong foundation. Week 7 will prove it.",
        "Day 7 (Sunday) — Rest. Full rest or very light activity (walking, mobility). Week 6 is done. You're 75% through the program (Week 6 of 8). Assess: Strength gains—compare Week 6 maxes to Week 1 baselines (if you tracked; if not, start tracking Week 7). Work capacity—sessions still 35-40min or have they crept longer? If longer, tighten rest periods. Energy levels—do you feel more energized overall despite busy schedule, or more run-down? If run-down, Week 8 deload will fix that. Mental state—excited for Week 7 peak test or dreading it? If dreading, remind yourself: Week 7 is just a test, not a competition. You're testing progress, not proving anything. And Week 8 deload is right after—there's a light at the end of the tunnel. Prepare mentally for Week 7: You'll be lifting 75-80% estimated 1RM for 8-10 reps @ RPE 8-9 (only 1-2 reps left in reserve). It'll feel challenging—that's the point. Approach it with confidence: you've been building to this for 6 weeks. Trust your training, execute with perfect form, and see how much you've progressed. Week 8 you'll recover, then decide your next steps. You've got 2 weeks left. Finish strong."
      ]
    }
  }
]
