[
  {
    "planId": "beginner-general-fitness",
    "weekNumber": 1,
    "metadata": {
      "title": "Beginner Week 1 — Movement Pattern Introduction (Form Mastery Phase)",
      "phase": "Weeks 1-4: Form Mastery",
      "progressionFocus": "Learn movement patterns with light loads",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 1 — Movement Pattern Introduction. This is your first week of structured training. The goal is to learn fundamental movement patterns (squat, hinge, push, pull) with light loads while building confidence and creating a sustainable training rhythm. Intensity stays very conservative (RPE 5-6, ~50-60% estimated 1RM) to allow for skill acquisition without excessive fatigue or soreness. Every rep is a learning opportunity—focus on feeling the movement, not lifting heavy weight. Expect some muscle soreness (DOMS) as your body adapts to new stimulus, but no joint pain. If something hurts (not burns), stop and modify.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Full Body: Lower Emphasis. Primary focus: Squat and hinge pattern education. Start with bodyweight movements to learn the pattern (air squats, hip hinges with PVC pipe or broomstick) before adding any external load. Once you feel confident with the pattern, add light weight. Volume: 2 sets of 12-15 reps per exercise. Rest: 60-90sec between sets. Movement quality is the ONLY priority—if form breaks down, reduce weight or reps immediately. Today's session: (1) Warm-up 5min: light cardio (walk, bike, row) + dynamic stretches (leg swings, arm circles), (2) Goblet Squat 2x12-15 (use lightest dumbbell or kettlebell, focus on depth and upright torso), (3) Dumbbell RDL 2x12-15 (light DBs, feel hamstring stretch, soft knees), (4) Dumbbell Bench Press 2x12-15 OR Push-ups 2x8-12 (chest-supported on bench or modified on knees if needed), (5) Core: Plank 3x20-30sec (focus on breathing, no sagging), (6) Cooldown 5min: static stretching (quad stretch, hamstring stretch, chest stretch).",
        "Day 2 (Tuesday) — Rest. Optional: 10-15min easy walk if you feel restless. This is a recovery day—your muscles are adapting to the new stimulus from Monday. Mild soreness is normal and expected. Stay hydrated, eat adequate protein (~0.7g per lb bodyweight), and focus on sleep (7-9 hours).",
        "Day 3 (Wednesday) — Full Body: Upper Emphasis. Primary focus: Horizontal and vertical push/pull patterns. Volume: 2 sets of 12-15 reps. Tempo: 3-1-1 (3sec descent, 1sec pause, 1sec lift)—this builds control and body awareness. Today's session: (1) Warm-up 5min: light cardio + dynamic stretches (band pull-aparts, scapular shrugs), (2) Dumbbell Bench Press 2x12-15 OR Push-ups 2x8-12 (same as Monday—consistency helps pattern learning), (3) Seated Cable Row 2x12-15 OR Chest-Supported Row (focus on pulling shoulder blades together, not just moving arms), (4) Lat Pulldown 2x12-15 OR Assisted Pull-up (focus on pulling elbows down, not hands), (5) Core: Dead Bug 3x10/side (press low back into floor, move slowly), (6) Cooldown 5min: stretching (shoulder stretch, lat stretch, hip flexor stretch).",
        "Day 4 (Thursday) — Rest. Full recovery day. No structured exercise. If experiencing significant soreness, consider 5-10min of light stretching or foam rolling (very gentle—don't press hard into sore muscles). Sleep and nutrition are your training tools today.",
        "Day 5 (Friday) — Full Body: Balanced. Primary focus: Reinforcing all patterns learned this week. Volume: 2-3 sets of 12-15 reps (can add 1 set to exercises that felt easy on Monday/Wednesday). This session ties together Monday and Wednesday's work—you should feel more confident with the movements now. Today's session: (1) Warm-up 5min, (2) Goblet Squat 2-3x12-15 (same weight as Monday, but focus on moving more smoothly), (3) Dumbbell RDL 2-3x12-15 (feel the hip hinge—this is key for deadlift later), (4) Dumbbell Bench Press 2-3x12-15, (5) Seated Cable Row 2-3x12-15, (6) Dumbbell Shoulder Press 2x10-12 (introduce vertical press pattern—light weight, strict form), (7) Core: Bird Dog 3x8/side (opposite arm/leg, hold balance), (8) Optional: 10min Zone 2 cardio post-workout (easy bike, walk, or row—conversational pace), (9) Cooldown 5min. Celebrate completing Week 1! You've built the foundation.",
        "Day 6 (Saturday) — Active Recovery (Optional). Suggested: 20-30min easy walk, yoga, swimming, or any low-intensity movement you enjoy. Purpose: Blood flow and mental recovery without adding training stress. Movement feels good after a training week—keep it light and enjoyable. Not mandatory—full rest is also perfectly fine.",
        "Day 7 (Sunday) — Rest. Complete recovery. Reflect on Week 1: What felt good? What was challenging? Any movements that felt awkward? Make notes for Week 2. Prepare mentally for next week: same structure, same exercises, but slightly more confidence with the movements. Progressive overload doesn't start until Week 5—for now, just master the patterns."
      ]
    }
  },
  {
    "planId": "beginner-general-fitness",
    "weekNumber": 5,
    "metadata": {
      "title": "Beginner Week 5 — Progressive Overload Begins (Load Increase Phase)",
      "phase": "Weeks 5-8: Progressive Overload",
      "progressionFocus": "Increase load by 5-10lbs when hitting 3x15 reps with perfect form",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 5 — Progressive Overload Begins. You've completed the form mastery phase (Weeks 1-4) and built confidence with all movement patterns. Now we begin progressive overload: adding weight when you can complete 3 sets of 15 reps with perfect form. This week, intensity rises to RPE 6-7 (~60-70% estimated 1RM). The movements should feel familiar now—your focus shifts from 'learning the pattern' to 'challenging the muscles.' Volume increases to 3 sets across all exercises. Rest periods stay at 60-90sec. Track your weights in a simple log (notebook or phone)—you'll reference this to know when to add load. Soreness should be minimal compared to Week 1 (your body has adapted). If an exercise feels too easy at current weight, add 5-10lbs next session.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Full Body: Lower Emphasis. Today marks the start of progressive overload. You'll use weights that challenge you in the 12-15 rep range (should feel moderately hard by rep 12, difficult by rep 15). Volume: 3 sets of 12-15 reps. If you hit 3x15 with clean form, write it down—next week you'll add 5-10lbs. Session: (1) Warm-up 5min, (2) Goblet Squat 3x12-15 (increase weight from Week 4 if you hit 15 reps easily last week—should feel challenging by final reps), (3) Dumbbell RDL 3x12-15 (focus on hip hinge depth, feel hamstrings stretch), (4) Dumbbell Bench Press 3x12-15 (push for 15 reps on all sets—if you get it, add weight next Monday), (5) Seated Cable Row 3x12-15 (pull shoulder blades together, squeeze at contraction), (6) Core: Plank 3x40-45sec (increased from 30sec in Week 1—you're stronger now), (7) Cooldown 5min. Track your weights: Goblet Squat __lbs, RDL __lbs, Bench __lbs, Row __lbs.",
        "Day 2 (Tuesday) — Rest or 10-15min easy walk. Recovery is still critical. You're lifting heavier now, so your body needs adequate rest between sessions. Sleep 7-9 hours, eat protein with every meal.",
        "Day 3 (Wednesday) — Full Body: Upper Emphasis. Focus on upper body progressive overload. Volume: 3 sets of 12-15 reps. Session: (1) Warm-up 5min, (2) Dumbbell Bench Press 3x12-15 (same weight as Monday—consistency helps track progress), (3) Chest-Supported Row OR Seated Cable Row 3x12-15 (increase weight if Week 4 felt easy), (4) Lat Pulldown 3x12-15 (focus on pulling elbows down, controlled descent), (5) Dumbbell Shoulder Press 3x10-12 (this is newer—still building confidence, so reps slightly lower), (6) Core: Dead Bug 3x12/side (increased volume from Week 1), (7) Cooldown 5min. Track weights for all exercises.",
        "Day 4 (Thursday) — Rest. Mid-week recovery. No training.",
        "Day 5 (Friday) — Full Body: Balanced. Highest volume day of the week. Volume: 3 sets of 12-15 reps across all exercises. Session: (1) Warm-up 5min, (2) Goblet Squat 3x12-15, (3) Dumbbell RDL 3x12-15, (4) Dumbbell Bench Press 3x12-15 (third pressing session this week—you should feel strong and confident), (5) Seated Cable Row 3x12-15, (6) Dumbbell Shoulder Press 3x10-12, (7) Core: Bird Dog 3x10/side, (8) Optional: 10-15min Zone 2 cardio (easy effort, conversational pace), (9) Cooldown 5min. Review your log: Did you hit 3x15 on any exercise this week? If yes, add 5-10lbs next week (Week 6). Progressive overload in action!",
        "Day 6 (Saturday) — Active Recovery (Optional). 20-30min easy movement: walk, yoga, bike ride, swimming. Keep it enjoyable and low-intensity.",
        "Day 7 (Sunday) — Rest. Prepare for Week 6: You'll continue with 3x12-15 reps, but increase weight on any exercises where you hit 3x15 this week. The next 3 weeks (Weeks 5-8) follow this pattern: add weight when you hit top of rep range. Week 8 is a scheduled deload (you'll reduce volume and intensity to recover before Weeks 9-12)."
      ]
    }
  },
  {
    "planId": "beginner-general-fitness",
    "weekNumber": 9,
    "metadata": {
      "title": "Beginner Week 9 — Introduction to Barbell Lifts (Complexity Phase)",
      "phase": "Weeks 9-12: Barbell Introduction",
      "progressionFocus": "Introduction to barbell lifts (squat, deadlift, bench press), continue load increases",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 9 — Introduction to Barbell Lifts. You've completed 8 weeks of training: 4 weeks of form mastery, 3 weeks of progressive overload, and 1 deload week (Week 8). Now you're ready for barbells. This week introduces the 'big three' barbell lifts: back squat, deadlift, and bench press. These are compound movements that will form the foundation of your training going forward. Start light (just the bar, or bar + 10-20lbs) to learn the new movement patterns—barbells feel different than dumbbells due to stability demands. Volume: 3 sets of 10-12 reps (slightly lower than previous weeks to accommodate the learning curve). Intensity: RPE 6-7 (~60-70% 1RM). The goal this week is technical mastery—weight is secondary. Film your lifts if possible (side angle for squat/deadlift, front angle for bench). You'll continue with barbells through Week 12, progressively adding load.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Full Body: Lower Emphasis + Barbell Squat Introduction. Today you learn the barbell back squat. If you have access to a coach or training partner, ask them to watch your first few sets. If training alone, film yourself (side angle, full body visible). Volume: 3 sets of 10-12 reps. Session: (1) Warm-up 5min + bodyweight squats 2x10 (prime the pattern), (2) Barbell Back Squat 3x10-12 (start with JUST THE BAR for Set 1—45lbs/20kg. If form is clean, add 10-20lbs for Sets 2-3. Focus: depth to parallel or below, chest up, knees tracking over toes, weight in heels. Rest 90-120sec between sets—barbell squats are more demanding), (3) Dumbbell RDL 3x12 (keep this from previous weeks—you're confident here), (4) Dumbbell Bench Press 3x12 (will transition to barbell bench on Wednesday), (5) Seated Cable Row 3x12, (6) Core: Plank 3x45sec, (7) Cooldown 5min. Notes: How did the barbell squat feel? Any wobbling? Depth issues? Note these for next week.",
        "Day 2 (Tuesday) — Rest. Your body is adapting to new movement demands (barbells require more stabilization than dumbbells). Soreness may increase slightly—this is normal. Stretch gently if needed.",
        "Day 3 (Wednesday) — Full Body: Upper Emphasis + Barbell Bench Press Introduction. Today you learn barbell bench press. Set up: lie on bench, feet flat on floor, grip slightly wider than shoulders, bar over chest (nipple line), lower to chest with control, press straight up. Have a spotter if possible (especially if you're new to barbell bench). Volume: 3 sets of 10-12 reps. Session: (1) Warm-up 5min + push-ups 2x10, (2) Barbell Bench Press 3x10-12 (start with bar only for Set 1. If form is clean, add 10-20lbs for Sets 2-3. Focus: controlled descent, pause on chest, explosive press, keep elbows ~45° from body. Rest 90-120sec), (3) Chest-Supported Row OR Barbell Row 3x12 (if you feel confident, you can try barbell row—same setup as RDL but pull bar to sternum), (4) Lat Pulldown 3x12, (5) Dumbbell Shoulder Press 3x10, (6) Core: Dead Bug 3x12/side, (7) Cooldown 5min.",
        "Day 4 (Thursday) — Rest. Two new barbell lifts this week (squat, bench). Let your nervous system recover.",
        "Day 5 (Friday) — Full Body: Balanced + Barbell Deadlift Introduction. Today you learn the conventional deadlift. This is the final 'big three' lift. Setup: feet hip-width, bar over mid-foot, grip just outside legs, hinge at hips, keep back neutral, push floor away to stand up. Film this one (side angle)—back position is critical. Volume: 3 sets of 8-10 reps (slightly lower reps because deadlift is very demanding). Session: (1) Warm-up 5min + light RDLs 2x10 (prime the hinge), (2) Barbell Deadlift 3x8-10 (start with bar + 25lbs per side = 95lbs total, or just bar if that feels heavy. Focus: neutral spine, push through heels, hips and shoulders rise together. Rest 2min between sets—deadlifts are taxing), (3) Barbell Back Squat 3x10 (second squat session this week—should feel more confident than Monday), (4) Barbell Bench Press 3x10 (second bench session—grooved the pattern on Wednesday), (5) Seated Cable Row 3x12, (6) Core: Bird Dog 3x10/side, (7) Cooldown 5min. Celebrate: You've now learned the big three! Weeks 10-12 will continue refining these movements and adding weight progressively.",
        "Day 6 (Saturday) — Active Recovery (Optional). 20-30min easy walk, yoga, stretching. Your body just learned three new complex movements—gentle movement aids recovery.",
        "Day 7 (Sunday) — Rest. Reflect on Week 9: How did the barbells feel? Any movements that felt awkward? Review your videos if you filmed. Week 10 will continue with barbells, adding 5-10lbs to squat/bench/deadlift if form was clean this week. You're transitioning from 'beginner' to 'novice lifter'—this is exciting progress!"
      ]
    }
  }
]
