[
  {
    "planId": "advanced-powerlifting-peak",
    "weekNumber": 2,
    "metadata": {
      "title": "Advanced Week 2 — Accumulation Phase (Volume Building & Technique Refinement)",
      "phase": "Weeks 1-4: Accumulation",
      "progressionFocus": "Build work capacity with 4-5 sets of 5-8 reps @ RPE 7-8, secondary variations, hypertrophy accessories",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 2 — Accumulation Phase. You're building on Week 1's foundation, continuing to accumulate training volume at moderate intensity (RPE 7-8, ~70-75% 1RM). This phase is about work capacity, technique refinement, and hypertrophic base-building—not maxing out. Competition lifts (squat, bench, deadlift) are practiced 2-3x per week: one primary day (heavier, lower reps) and one secondary day (lighter, higher reps or variations). Secondary variations like pause squats, close-grip bench, and deficit deadlifts address weak points and build positional strength without the neural demand of competition lifts. Accessories target specific weaknesses: if your lockout is weak, you'll do board presses or close-grip work; if you're weak out of the hole, you'll do pause squats or front squats. Volume is 4-5 sets per main lift (more than you'll do in peaking phase, where volume drops to 2-3 sets). Rest periods are generous (2-3min compounds, 90-120sec accessories) to ensure quality reps. Track all main lifts: weight, reps, RPE. This data guides progression—if Week 1's RPE 7-8 felt like RPE 7, add 5-10lbs this week; if it felt like RPE 8.5, hold weight and focus on bar speed. You should finish workouts feeling worked but not destroyed. Soreness is normal but manageable. Sleep 7-8 hours minimum, eat at maintenance or slight surplus (you're building mass and strength simultaneously).",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Lower: Squat Emphasis (Primary Squat Day). Focus: Competition squat with heavy volume, quad/glute accessories. Session: (1) Warm-up 10min: 5min bike/row (light sweat), dynamic stretches (leg swings, hip circles, ankle mobility), bar work (empty bar squats, 3rd-world squats, goblet squats), (2) Competition Squat (High-Bar or Low-Bar based on preference) 5x5 @ RPE 7-8 (~70-75% 1RM). This is your primary squat day—heaviest volume of the week. Focus: Bar path (straight up/down), depth (parallel or below), bracing (big breath, brace core, maintain throughout rep), tempo (controlled 2-3sec descent, no pause at bottom, explosive up). Rest 3min between sets. If Week 1 felt easy (RPE 7), add 5-10lbs today. If it felt hard (RPE 8.5), repeat Week 1 weight and focus on speed/technique. Record: weight, actual reps, RPE per set. (3) Pause Squat (2sec pause at parallel) 4x3 @ RPE 7 (~60-65% 1RM). Secondary variation: Addresses weakness out of the hole, teaches patience and position maintenance. Setup: Same as competition squat. Execution: Descend to parallel, PAUSE 2sec (count "one-thousand-one, one-thousand-two"), then drive up explosively. Don't relax in the hole—stay tight. Rest 2-3min. (4) Romanian Deadlift (RDL) 3x8 @ RPE 7-8. Hamstring/glute hypertrophy and posterior chain strength. Execution: Hinge at hips, push hips back, feel hamstring stretch (bar travels down shins to mid-shin), squeeze glutes to return. Don't round lower back. Rest 2min. (5) Bulgarian Split Squat 3x10/leg @ RPE 8. Unilateral quad/glute work, addresses imbalances. Execution: Rear foot elevated on bench, front leg does all the work, descend until front thigh is parallel, drive through heel. Rest 90sec between legs. (6) Leg Press 3x12-15 @ RPE 8. Quad volume without spinal load (recovery-friendly). Push through heels, full ROM (deep stretch, full extension but don't lock knees aggressively). Rest 90sec. (7) Cooldown 5-10min: Static stretching (quads, hip flexors, hamstrings, glutes), light foam rolling (IT band, quads, glutes). Total session: 75-90min.",
        "Day 2 (Tuesday) — Upper: Bench Emphasis (Primary Bench Day). Focus: Competition bench press with heavy volume, lockout/stability accessories. Session: (1) Warm-up 10min: 5min light cardio, dynamic upper body work (arm circles, band pull-aparts, scapular push-ups, empty bar pressing), (2) Competition Bench Press 5x5 @ RPE 7-8 (~70-75% 1RM). Primary bench day—heaviest pressing volume. Setup: Feet flat on floor (or elevated if mobility limited), arch in upper back, shoulder blades retracted and pinned to bench, grip width just outside shoulders (or wider/narrower based on preference). Execution: Unrack, bar over sternum, lower to chest (touch lightly, no bounce), press straight up (bar path slightly diagonal toward face). Breathe at top. Rest 3min. Record weight/reps/RPE. If Week 1 felt easy, add 5lbs. (3) Close-Grip Bench Press 4x6 @ RPE 7-8 (~65-70% 1RM). Secondary variation: Addresses triceps/lockout weakness. Grip: Hands shoulder-width or slightly narrower (not too narrow—elbow stress). Lower to chest, press explosively. Rest 2-3min. (4) Incline Dumbbell Press 3x8-10 @ RPE 8. Upper chest/front delt hypertrophy. Incline bench ~30-45°, press dumbbells up and slightly together (don't bang them), control descent. Rest 2min. (5) Barbell Row (Pendlay or Bent-Over) 4x8 @ RPE 7-8. Upper back thickness—critical for bench stability and shoulder health. Execution: Pull to sternum, squeeze shoulder blades together, control descent. No momentum. Rest 2min. (6) Face Pulls 3x15-20 @ RPE 8. Rear delt/upper back health. Pull rope to face, externally rotate at end (thumbs back), squeeze rear delts. Rest 90sec. (7) Dumbbell Overhead Triceps Extension 3x10-12 @ RPE 8. Triceps hypertrophy (complements pressing). Control eccentric, stretch triceps at bottom, extend fully. Rest 90sec. (8) Cooldown 5-10min: Stretching (chest, shoulders, triceps), light band work (external rotations for shoulder health). Total session: 70-85min.",
        "Day 3 (Wednesday) — Rest or Active Recovery. Complete rest is ideal after two heavy days. Your CNS and joints need recovery—Monday's squats and Tuesday's pressing are neurally demanding. If you feel restless: (Option A) 15-20min Zone 2 cardio (bike, incline walk at conversational pace—should feel restorative, not taxing), (Option B) 10-15min gentle mobility/stretching (focus on hips, shoulders, ankles—areas of tightness), (Option C) Complete rest (Netflix, nap, meal prep, foam rolling). Do NOT lift today. Your body grows during recovery, not training. Prioritize: Sleep 7-8 hours tonight (set consistent bed/wake times), nutrition (hit protein target: ~1g/lb bodyweight for powerlifting, slight calorie surplus during accumulation to support strength gains), hydration (half your bodyweight in oz of water), stress management (training is a stressor—minimize others where possible). Reflect: How did Monday's squats feel compared to Week 1? How about Tuesday's bench? Any form breakdown? Any exercises that felt awkward? Note these—use Thursday's session to address.",
        "Day 4 (Thursday) — Lower: Deadlift Emphasis (Primary Deadlift Day). Focus: Competition deadlift with heavy volume, secondary squat work (lighter %), posterior chain accessories. Session: (1) Warm-up 10min: Light cardio, dynamic stretching (leg swings, hip openers, cat-cow for spine), bar work (empty bar RDLs, light deadlifts with focus on setup), (2) Competition Deadlift (Conventional or Sumo based on preference) 5x4 @ RPE 7-8 (~70-75% 1RM). Primary deadlift day—this is the most taxing lift of the week. Setup: Feet hip-width (conventional) or wide (sumo), grip just outside legs (double-overhand or mixed grip—save straps for 80%+ loads), bar over mid-foot, shins vertical, chest up, lats engaged ("bend the bar"), big breath and brace. Execution: Push floor away with legs (don't yank bar), bar stays close to body (scrape shins/thighs), hips and shoulders rise together, lockout with glutes (no hitching). Rest 3min between sets. Don't grind reps—if bar speed slows significantly, stop set (RPE 7-8, not 9). Record weight/reps/RPE. (3) Deficit Deadlift (stand on 1-2" platform/plates) 4x3 @ RPE 7 (~60-65% 1RM). Secondary variation: Increases ROM, strengthens off-the-floor position. Same setup/execution as competition DL but from elevated surface (bar starts lower). Rest 3min. (4) Front Squat OR High-Bar Squat 3x6 @ RPE 7-8 (~60-65% of back squat 1RM). Secondary squat work—lighter than Monday but maintains frequency. Front squat if you need quad emphasis; high-bar if you already do low-bar. Focus on speed and depth. Rest 2-3min. (5) Glute-Ham Raise OR Nordic Curls 3x8-10 @ RPE 8. Posterior chain hypertrophy (hamstrings/glutes). Execution: Control eccentric, use hands to assist if needed on concentric. Rest 2min. (6) Leg Curls 3x12-15 @ RPE 8. Hamstring isolation, complements compound work. Squeeze at contraction, control descent. Rest 90sec. (7) Cooldown 5-10min: Stretching (hamstrings, glutes, lower back—be gentle with lower back after deadlifts), light walking to flush blood through legs. Total session: 75-90min. Thursday is the most demanding day of the week—deadlifts plus secondary squat work. Expect significant fatigue.",
        "Day 5 (Friday) — Rest or Active Recovery. Another rest day after Thursday's heavy deadlift session. Deadlifts are uniquely fatiguing—they tax the entire posterior chain, grip, and CNS. Friday rest ensures you're recovered for Saturday's volume upper day. Options same as Wednesday: complete rest (preferred), light Zone 2 cardio (15-20min), or gentle mobility work. Do NOT lift. Prioritize recovery: Sleep 7-8 hours, eat well (especially post-Thursday dinner and Friday meals—refuel glycogen, repair tissue), manage stress, hydrate. If lower back is sore from deadlifts, consider: Gentle stretching (child's pose, cat-cow, seated hamstring stretch), light heating pad or hot bath (increases blood flow, reduces stiffness), foam rolling glutes and upper hamstrings (avoid rolling directly on lower back—too much pressure on spine). Soreness is normal during accumulation phase, but pain is not—if you have sharp pain or significant joint discomfort, address it (reduce loads, check form, consider physio consult). Reflect: How did Thursday's deadlifts feel? Bar speed? Any form breakdown (rounding, hitching)? Compare to Week 1—are you stronger, or is fatigue accumulating? This informs next week's loading.",
        "Day 6 (Saturday) — Upper: Volume Bench + Accessory Emphasis (Secondary Bench Day). Focus: Lighter bench work (70-80% of Tuesday's load), higher rep ranges, arm/back volume for hypertrophy. Session: (1) Warm-up 10min: Light cardio, dynamic upper body stretches, bar work (empty bar pressing, band pull-aparts), (2) Competition Bench Press 4x8 @ RPE 7 (~60-65% 1RM, or ~70-80% of Tuesday's weight). Secondary bench day—lighter load, higher reps, focus on bar speed and technique. If you benched 225lbs x 5 on Tuesday, use ~185lbs x 8 today. Should feel smooth and controlled. Rest 2-3min. (3) Dumbbell Bench Press 3x10-12 @ RPE 8. Chest hypertrophy, allows greater ROM and unilateral work. Press dumbbells up and slightly together, control descent. Rest 2min. (4) Dips (weighted if possible) OR Machine Chest Press 3x10-12 @ RPE 8. Chest/triceps hypertrophy. Dips: Lean forward for chest emphasis, upright for triceps. If bodyweight is too easy, add weight via belt. Rest 2min. (5) Pull-Ups OR Lat Pulldown 4x8-10 @ RPE 7-8. Back width, balance pressing volume. Focus on pulling elbows down (not hands), squeeze lats at bottom. Rest 2min. (6) Seated Cable Row 3x12-15 @ RPE 8. Back thickness. Pull to sternum, squeeze shoulder blades, control return. Rest 90sec. (7) Barbell Curls 3x10-12 @ RPE 8. Biceps hypertrophy (not just for aesthetics—biceps assist in arm position during bench). Strict form, no swinging. Rest 90sec. (8) Skull Crushers OR Overhead Rope Extension 3x12-15 @ RPE 8. Triceps hypertrophy, complements pressing. Control eccentric, full extension. Rest 90sec. (9) Cooldown 5-10min: Stretching (chest, lats, biceps, triceps), band pull-aparts (20-30 reps light, shoulder health). Total session: 70-85min. This is a volume day—you should get a good pump, but it shouldn't feel as heavy as Tuesday.",
        "Day 7 (Sunday) — Rest (Complete Rest Recommended). Full rest after 4 training days. Your body has accumulated volume all week: 5x5 squats, 5x5 bench, 5x4 deadlifts, plus all accessory work. Sunday is when adaptation happens—muscles repair, tendons strengthen, nervous system recovers. Do NOT train. Optional light activity: 10-15min easy walk (just for movement/mental reset), gentle stretching or yoga (20-30min, focus on mobility and relaxation). Otherwise: Complete rest. Prioritize: Sleep 8 hours (catch up if you've been short any nights this week), meal prep for Week 3 (having food ready reduces stress and ensures nutrition compliance), social time or hobbies (training is important, but so is life balance—overtraining includes mental/emotional stress), reflection and planning (review Week 2 training log: Did weights feel appropriate? Any RPE mismatches? Any form issues? Plan Week 3 loads: if everything felt RPE 7-7.5, add 5-10lbs to main lifts; if it felt RPE 8-8.5, repeat weights and focus on bar speed). Week 2 is complete. You've built on Week 1's foundation, accumulated more volume, and continued refining technique. Weeks 3-4 continue accumulation (potentially adding 1 set to main lifts in Week 4, or increasing reps from 5 to 6-8). Then Week 5 begins strength building phase (heavier loads, lower reps, wave loading). You're on track. Trust the process, eat, sleep, and prepare for Week 3."
      ]
    }
  },
  {
    "planId": "advanced-powerlifting-peak",
    "weekNumber": 6,
    "metadata": {
      "title": "Advanced Week 6 — Strength Building Phase (Wave Loading Peak: 82.5% 4x3)",
      "phase": "Weeks 5-8: Strength Building",
      "progressionFocus": "Week 2 of wave loading: 82.5% 1RM for 4x3 @ RPE 8-9, reduce accessories, prepare for Week 7 peak",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 6 — Strength Building Phase (Wave Loading Week 2: 82.5% 4x3). You're in the middle of the strength building block, using wave loading to progressively increase intensity while managing fatigue. Wave loading structure: Week 5 (80% 4x4 @ RPE 8-9), Week 6 (82.5% 4x3 @ RPE 8-9), Week 7 (85% 3x3 @ RPE 9), Week 8 (deload at 70-75% of Week 7). This week, loads increase to 82.5% 1RM for 4 sets of 3 reps on competition lifts—heavier than Week 5 (80%), but one fewer rep per set (3 vs 4). Volume per lift decreases (12 total reps vs 16), but intensity increases. RPE remains 8-9 (only 1-2 reps left in reserve). Bar speed is critical: if the third rep of any set is a grind (takes >3sec), the weight is too heavy—reduce by 5-10lbs and maintain quality. Competition variations (pause squats, close-grip bench, deficit deadlifts) are reduced or eliminated—focus shifts to competition lifts exclusively. Accessories drop to 3 sets of 6-8 reps (from 3-4 sets of 8-12 in accumulation) to preserve energy for heavy compounds. Rest periods remain long (3min compounds). Expect neural fatigue—you're handling heavier weights, so CNS demands are higher. Sleep becomes even more critical (7-8 hours minimum), and nutrition must support strength gains (eat at maintenance or slight surplus, prioritize pre/post-workout nutrition). This is challenging but not crushing—Week 7 will be the peak of the strength block, then Week 8's deload will dissipate accumulated fatigue before peaking phase. Track: weight, reps, RPE, bar speed (was it fast/moderate/slow?). This data confirms whether loads are appropriate.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Lower: Squat Emphasis (82.5% 4x3). Focus: Competition squat at 82.5% 1RM for 4x3 @ RPE 8-9. Session: (1) Warm-up 10-15min: 5min cardio (light sweat), thorough dynamic stretching (hip circles, leg swings, ankle mobility—hips and ankles get stiff with heavy squats), bar work (empty bar squats x 10, goblet squats x 5, paused squats with bar x 3). Warm-up sets (gradual load increase): Bar x 10, 135lbs x 5, 185lbs x 3, 225lbs x 2, 275lbs x 1, then working weight. (2) Competition Squat 4x3 @ RPE 8-9 (~82.5% 1RM). If your 1RM is 400lbs, working weight today is ~330lbs. If Week 5 (80% = 320lbs) felt like RPE 8, then 330lbs should feel RPE 8.5-9 for 3 reps. Third rep should be challenging but fast—if it grinds (>3sec), reduce weight by 10lbs next set. Setup: Maximize tightness (big breath, brace hard, upper back tight), approach bar with confidence (don't psyche yourself out). Execution: Unrack, walk out (2-3 steps max, no excessive repositioning), big breath and brace, descend with control (2-3sec, no dive-bombing), hit depth, drive up explosively. Focus: Speed off the bottom (if you're slow out of the hole, you're losing power—may need pause squat accessory work in future). Rest 3-4min between sets (full recovery—this is heavy work). Record: weight, reps completed, RPE per set, bar speed notes (fast/moderate/slow). (3) Front Squat 3x5 @ RPE 8 (~60-65% of back squat 1RM). Secondary squat work—lighter than Week 2's 3x6, shorter to preserve energy. Front squats teach upright posture and quad strength. Rest 3min. (4) Romanian Deadlift 3x6-8 @ RPE 8. Hamstring/glute strength, reduced volume from accumulation (was 3x8). Rest 2min. (5) Leg Press 3x10-12 @ RPE 8. Quad hypertrophy without spinal load. Rest 90sec. (6) Cooldown 5-10min: Stretching (quads, hip flexors, glutes), light foam rolling (IT band, quads). Total session: 75-85min. You should feel heavy neural fatigue—squats at 82.5% are demanding.",
        "Day 2 (Tuesday) — Upper: Bench Emphasis (82.5% 4x3). Focus: Competition bench at 82.5% 1RM for 4x3 @ RPE 8-9. Session: (1) Warm-up 10-15min: 5min cardio, dynamic upper body work (arm circles, band pull-aparts, scapular push-ups), bar work (empty bar pressing x 10, pause presses x 5). Warm-up sets: Bar x 10, 95lbs x 5, 135lbs x 3, 185lbs x 2, 225lbs x 1, then working weight. (2) Competition Bench Press 4x3 @ RPE 8-9 (~82.5% 1RM). If 1RM is 300lbs, working weight is ~250lbs. Week 5 (80% = 240lbs) felt RPE 8-8.5; today's 250lbs should feel RPE 8.5-9. Third rep is challenging but controlled—if it stalls mid-press or takes >3sec, reduce weight 5lbs next set. Setup: Perfect setup is critical at this intensity—feet planted, arch locked in, shoulder blades retracted and pinned, grip secure, unrack with confidence. Execution: Lower to chest (control descent, touch lightly), press explosively (bar path slightly diagonal toward face), lockout fully but don't hyperextend elbows. Rest 3-4min between sets. Record: weight, reps, RPE, bar speed (did third rep slow down significantly?). (3) Close-Grip Bench Press 3x5 @ RPE 8 (~65% 1RM). Lockout/triceps work, reduced volume from accumulation. Rest 3min. (4) Barbell Row 3x6-8 @ RPE 8. Upper back strength for bench stability. Reduced volume to preserve energy. Rest 2min. (5) Dumbbell Incline Press 3x8-10 @ RPE 8. Upper chest/front delt, moderate hypertrophy work. Rest 2min. (6) Face Pulls 3x15-20 @ RPE 7-8. Rear delt/shoulder health—keep this despite reduced accessories (shoulder health is non-negotiable). Rest 90sec. (7) Cooldown 5-10min: Stretching (chest, shoulders, triceps), band work (external rotations, light pull-aparts). Total session: 70-80min.",
        "Day 3 (Wednesday) — Rest or Very Light Active Recovery. Rest is more important than ever during strength building phase. 82.5% loads create significant CNS fatigue. Wednesday rest allows recovery before Thursday's heavy deadlifts. Options: (A) Complete rest (preferred), (B) 10-15min very easy Zone 1 cardio (walking at slow pace, light bike—heart rate stays low, feels effortless), (C) 10-15min mobility/stretching (focus on tight areas: hips, shoulders, ankles). Do NOT lift or do conditioning today. Prioritize: Sleep 7-8 hours (set consistent schedule), nutrition (hit protein target, eat at maintenance or slight surplus to support strength), stress management (heavy lifting is a stressor—minimize others), hydration, mental recovery (heavy weights are mentally demanding—read, relax, socialize, decompress). Reflect: How did Monday's squats at 82.5% feel? How about Tuesday's bench? Compare to Week 5 (80%)—was the jump manageable? Any form breakdown at heavier weight? Note these for Thursday's deadlifts.",
        "Day 4 (Thursday) — Lower: Deadlift Emphasis (82.5% 4x2-3). Focus: Competition deadlift at 82.5% 1RM for 4x2-3 @ RPE 8-9. Note: Deadlifts are more fatiguing than squats/bench, so reps may be 2 instead of 3 (4x2 @ RPE 9 is common for deadlifts at 82.5%). Session: (1) Warm-up 10-15min: 5min cardio, dynamic stretching (hip openers, leg swings, cat-cow for spine mobility), bar work (empty bar RDLs, light deadlifts focusing on setup and bracing). Warm-up sets: 135lbs x 5, 185lbs x 3, 225lbs x 2, 275lbs x 1, 315lbs x 1, then working weight. (2) Competition Deadlift 4x2-3 @ RPE 8-9 (~82.5% 1RM). If 1RM is 500lbs, working weight is ~415lbs. Week 5 (80% = 400lbs) felt RPE 8-8.5 for 3 reps; today's 415lbs will feel RPE 8.5-9 for 2-3 reps. Some lifters can only manage 2 clean reps at this intensity—that's fine. Setup: Perfect setup every rep—feet positioned, bar over mid-foot, shins vertical, grip secure (mixed or hook grip at this weight—straps if grip is failing but try without first), chest up, lats engaged (pull slack out of bar, feel tension before pulling), big breath and brace. Execution: Push floor away (leg drive), bar scrapes shins/thighs, hips and shoulders rise together (don't shoot hips up first), lockout with glutes (stand tall, don't lean back excessively). Rest 3-4min between sets. If second or third rep is a significant grind (takes >4-5sec, form breaks down, back rounds), stop set and reduce weight 10lbs next set. Record: weight, reps, RPE, bar speed, any form notes (did hips shoot up? did back round?). (3) Deficit Deadlift 3x2 @ RPE 7-8 (~60-65% 1RM). Off-the-floor strength, reduced volume significantly from accumulation. Rest 3min. (4) Front Squat OR High-Bar Squat 3x5 @ RPE 7-8 (~60% back squat 1RM). Secondary squat work, lighter than Monday's competition squat. Rest 2-3min. (5) Glute-Ham Raise 3x8 @ RPE 8. Posterior chain, reduced volume. Rest 2min. (6) Cooldown 5-10min: Stretching (hamstrings, glutes, lower back—gentle), light walking. Total session: 75-90min. Thursday is the most demanding day—expect significant fatigue after deadlifts.",
        "Day 5 (Friday) — Rest. Full rest after Thursday's deadlifts. Deadlifts at 82.5% are uniquely fatiguing—grip, lower back, hamstrings, glutes, and CNS are all taxed. Friday rest is non-negotiable. Do NOT lift. If lower back is sore (common after heavy deadlifts): Gentle stretching (child's pose, cat-cow, knee-to-chest), light heat (heating pad, hot bath), avoid aggressive foam rolling on lower back (too much pressure on spine). Otherwise: Complete rest. Prioritize sleep, nutrition, hydration. Reflect: How did Thursday's deadlifts feel? Bar speed? Any form issues? Compare to Week 5—was the jump manageable? This informs Week 7's loads (85% for 3x3—heaviest of the strength block before Week 8 deload).",
        "Day 6 (Saturday) — Upper: Volume Bench + Accessory Emphasis (70-75% of Tuesday's weight). Focus: Lighter bench work, arm/back hypertrophy. Session: (1) Warm-up 10min, (2) Competition Bench Press 3x6-8 @ RPE 7 (~65-70% 1RM, or ~70-75% of Tuesday's 82.5%). If you benched 250lbs x 3 on Tuesday, use ~185-200lbs x 6-8 today. Bar speed should be fast. Rest 2-3min. (3) Dumbbell Bench Press 3x10 @ RPE 8. Chest hypertrophy, reduced reps from accumulation. Rest 2min. (4) Dips OR Machine Press 3x10 @ RPE 8. Chest/triceps, moderate volume. Rest 2min. (5) Pull-Ups OR Lat Pulldown 3x8 @ RPE 7-8. Back width. Rest 2min. (6) Seated Cable Row 3x10-12 @ RPE 8. Back thickness. Rest 90sec. (7) Barbell Curls 3x10 @ RPE 8. Biceps hypertrophy. Rest 90sec. (8) Skull Crushers 3x10-12 @ RPE 8. Triceps hypertrophy. Rest 90sec. (9) Cooldown 5-10min. Total session: 65-75min. This should feel lighter than Tuesday—focus on movement quality and getting a pump without heavy neural demand.",
        "Day 7 (Sunday) — Rest (Complete Rest Strongly Recommended). Full rest after 4 heavy training days. Week 6 has been intense: 82.5% loads on all competition lifts, wave loading in action, neural fatigue accumulating. Sunday rest allows adaptation. Do NOT train. Optional: 10-15min easy walk, gentle stretching. Otherwise complete rest. Prioritize: Sleep 8 hours (catch up if you've been short), meal prep for Week 7, social/mental recovery. Reflect: Review Week 6 training log—did 82.5% feel appropriate? RPE matches? Any form breakdown at heavier weight? Plan Week 7: 85% for 3x3 is the peak of the strength block (heaviest week before Week 8 deload). If Week 6 felt RPE 8.5-9 as prescribed, you're on track for 85%. If it felt like RPE 9.5 (too hard), consider holding 82.5% in Week 7 or only increasing to 83-84%. Wave loading is effective but only if you recover—don't push through excessive fatigue. Week 8 deload will dissipate all accumulated fatigue, then Week 9 begins peaking phase (90%+ loads, singles/doubles/triples). You're building toward competition. Trust the process, eat, sleep, and prepare for Week 7's peak."
      ]
    }
  },
  {
    "planId": "advanced-powerlifting-peak",
    "weekNumber": 10,
    "metadata": {
      "title": "Advanced Week 10 — Peaking Phase (Heavy Doubles: 92.5% 3x2)",
      "phase": "Weeks 9-11: Peaking",
      "progressionFocus": "Week 2 of peaking: 92.5% 1RM for 3x2 @ RPE 9.5, minimal accessories, competition lifts only",
      "isDeload": false
    },
    "microcycleOutput": {
      "overview": "Week 10 — Peaking Phase (Heavy Doubles: 92.5% 3x2). You're in the middle of the peaking block, handling loads very close to your 1RM. Peaking structure: Week 9 (90% 3x3), Week 10 (92.5% 3x2), Week 11 (95-97.5% work up to top single), Week 12 (taper: openers Wednesday, competition Sunday). This week, you're lifting 92.5% of your 1RM for 3 sets of 2 reps on competition lifts—heavier than Week 9 (90%), but one fewer rep per set (2 vs 3). Volume is minimal (6 total reps per lift), intensity is maximal (RPE 9.5, only 1 rep in reserve—second rep should be hard but clean). This is NOT the time to PR—you're practicing heavy weights to prepare your CNS, technique, and confidence for competition (or Week 11's heavy single). Bar speed on first rep should still be good; second rep will slow but should complete without significant grinding. If second rep stalls or takes >5sec, the weight is too heavy—competition is more important than hitting prescribed percentages. All accessories are eliminated or reduced to 2 sets of 8-10 reps—only keep movements that directly support competition lifts or address injury prevention (face pulls, light RDLs). No hypertrophy work. Rest periods are long (4-5min for main lifts—full recovery between sets is critical). Sleep is non-negotiable (8-9 hours), nutrition must be dialed in (eat at maintenance, prioritize pre/post-workout meals, hydrate), and mental preparation is key (visualize successful lifts, stay confident, trust your training). This week feels heavy—that's the point. You're teaching your body to handle near-maximal loads with perfect technique. Week 11 will be even heavier (singles), then Week 12's taper will dissipate fatigue and leave you fresh for competition.",
      "isDeload": false,
      "days": [
        "Day 1 (Monday) — Lower: Squat Emphasis (92.5% 3x2). Focus: Competition squat at 92.5% 1RM for 3x2 @ RPE 9.5. Session: (1) Warm-up 15min: This is critical at 92.5%—underprepared warm-up increases injury risk. 5min cardio (light sweat), thorough dynamic stretching (hip circles, leg swings, deep bodyweight squats, 90/90 hip stretches), bar work (empty bar squats x 10, paused squats x 5, tempo squats x 3). Warm-up sets (gradual, deliberate): Bar x 10, 135lbs x 5, 185lbs x 3, 225lbs x 2, 275lbs x 1, 315lbs x 1, 365lbs x 1 (if 1RM is 400lbs), then working weight (370lbs = 92.5%). Each warm-up set is deliberate—no rushing, perfect form, build confidence. (2) Competition Squat 3x2 @ RPE 9.5 (~92.5% 1RM). If 1RM is 400lbs, working weight is 370lbs. Week 9 (90% = 360lbs) felt RPE 9 for 3 reps; today's 370lbs will feel RPE 9.5 for 2 reps. First rep should move with decent speed (not fast, but not a grind). Second rep will slow significantly—this is expected at 92.5%. If second rep stalls, grinds excessively (>6sec), or you question depth/form, reduce weight 10lbs next set. Setup: Maximum tightness—big breath (fill belly and brace), upper back locked (squeeze bar into traps), confidence (approach bar like you own it). Walkout: 2-3 steps max, no repositioning (wasted energy). Execution: Descend with control (2-3sec, don't dive), hit depth (parallel or below—don't cut depth to save energy, you'll red-light in competition), pause 0.5sec at bottom (maintain tension, don't relax), DRIVE explosively (push through floor, hips and chest rise together, no good-morning squat). Lockout: Stand fully upright, wait for judge's call (in competition context), rack with control. Rest 4-5min between sets (sit down between sets, sip water, mentally reset). Record: weight, reps completed, RPE per set, bar speed on each rep (first rep: good/moderate/slow, second rep: moderate/slow/grind), depth confidence (did you hit depth easily or was it close?), any form breakdown (did chest collapse? did hips shoot up?). This data is critical for Week 11's single. (3) Front Squat OR High-Bar Squat 2x5 @ RPE 7 (~55-60% back squat 1RM). Secondary squat work—very light, only to maintain movement pattern and blood flow. This is NOT training—it's active recovery. Rest 2-3min. (4) Light Romanian Deadlift 2x8-10 @ RPE 6-7 (~50% DL 1RM). Hamstring/glute maintenance, very light. Rest 2min. (5) Cooldown 10min: Stretching (quads, hip flexors, glutes—gentle, no aggressive stretching when fatigued), light foam rolling (IT band, quads, but avoid aggressive pressure on sore areas). Total session: 70-80min. You should feel heavy neural fatigue but also confidence—you just handled 92.5% for doubles.",
        "Day 2 (Tuesday) — Upper: Bench Emphasis (92.5% 3x2). Focus: Competition bench at 92.5% 1RM for 3x2 @ RPE 9.5. Session: (1) Warm-up 15min: 5min cardio, dynamic upper body work (arm circles, band pull-aparts x 20, scapular push-ups x 10), bar work (empty bar pressing x 10, pause presses x 5, tempo presses x 3). Warm-up sets: Bar x 10, 95lbs x 5, 135lbs x 3, 185lbs x 2, 225lbs x 1, 265lbs x 1 (if 1RM is 300lbs), then working weight (277.5lbs = 92.5%). (2) Competition Bench Press 3x2 @ RPE 9.5 (~92.5% 1RM). If 1RM is 300lbs, working weight is ~277.5lbs (round to 275lbs or 280lbs based on available plates). Week 9 (90% = 270lbs) felt RPE 9 for 3 reps; 275-280lbs will feel RPE 9.5 for 2 reps. First rep moves with control (not explosive like 70%, but not a grind). Second rep slows—bar speed decreases, but it should still complete without stalling. If bar stalls mid-press or you need spotter assistance, weight is too heavy. Setup: Perfect setup is everything at this weight—feet planted firmly (drive through floor during press), arch established (upper back arched, not lower back—shoulder blades retracted and locked), grip secure (chalk if needed, thumbs around bar for safety), spotter present and attentive (communicate before set: "liftoff, ready, take it"—spotter gives liftoff, you control descent and press, spotter spots only if you fail). Execution: Unrack with confidence (spotter assists liftoff to save energy), position bar over sternum, big breath and brace, lower to chest with control (2-3sec descent, bar touches chest lightly—don't bounce), pause 0.5sec at chest (maintain tension), press explosively (drive bar up and slightly toward face, bar path diagonal, lockout fully but don't hyperextend elbows). Rest 4-5min between sets (sit up, sip water, shake out arms, mentally prepare). Record: weight, reps, RPE, bar speed (first rep: good/moderate, second rep: moderate/slow/grind), any form breakdown (did arch collapse? did bar path drift?), confidence (did you feel in control?). (3) Close-Grip Bench Press 2x5 @ RPE 7 (~60% 1RM). Very light, only for triceps/lockout maintenance. Rest 2-3min. (4) Light Barbell Row 2x8 @ RPE 6-7 (~60% of max row). Upper back maintenance. Rest 2min. (5) Face Pulls 2x15-20 @ RPE 6-7. Rear delt/shoulder health—keep this even during peaking (shoulder health is critical). Rest 90sec. (6) Cooldown 10min: Stretching (chest, shoulders, triceps), light band work (external rotations, pull-aparts). Total session: 65-75min.",
        "Day 3 (Wednesday) — Rest (Complete Rest Mandatory). Rest is not optional during peaking phase. Monday's squats and Tuesday's bench at 92.5% create massive CNS fatigue. Wednesday rest allows nervous system recovery before Thursday's heavy deadlifts (also 92.5%). Do NOT lift, do NOT condition, do NOT do "light" work. Complete rest. Activities allowed: Walking (10-15min at slow pace, purely for mental break), gentle stretching (focus on hip/shoulder mobility, no aggressive stretching), mental visualization (spend 10-15min visualizing successful competition lifts—see yourself squatting with perfect form, benching confidently, deadlifting explosively; this primes CNS for performance). Prioritize: Sleep 8-9 hours (set consistent bed/wake time, wind down routine: no screens 1hr before bed, cool dark room, melatonin if needed), nutrition (hit protein target: ~1g/lb, eat at maintenance or slight surplus, prioritize pre-competition-like meals—test what you'll eat on competition day), hydration (half bodyweight in oz of water, more if training in heat), stress management (peaking is stressful—minimize other stressors, say no to extra commitments, protect your energy). Reflect: How did Monday's squats at 92.5% feel? How about Tuesday's bench? Compare to Week 9 (90%)—was the jump manageable? Any form breakdown? Any confidence issues (did you doubt the weight before unracking?)? Note these for Thursday's deadlifts and Week 11's planning.",
        "Day 4 (Thursday) — Lower: Deadlift Emphasis (92.5% 3x1-2). Focus: Competition deadlift at 92.5% 1RM for 3x1-2 @ RPE 9.5. Note: Deadlifts at 92.5% are exceptionally demanding—many lifters only perform singles (3x1) at this intensity rather than doubles. If you attempt doubles and first rep is RPE 9.5, do NOT attempt second rep (injury risk). Session: (1) Warm-up 15-20min: Deadlifts require the most thorough warm-up of all three lifts. 5min cardio (very light, just warm muscles), dynamic stretching (hip openers, leg swings, cat-cow, deep bodyweight squats, 90/90 stretches), bar work (empty bar RDLs x 10, empty bar deadlifts x 5 focusing on setup and lat engagement). Warm-up sets (very deliberate, focus on speed and technique): 135lbs x 5, 185lbs x 3, 225lbs x 2, 275lbs x 1, 315lbs x 1, 365lbs x 1, 405lbs x 1, 455lbs x 1 (if 1RM is 500lbs), then working weight (462.5lbs = 92.5%, round to 460lbs or 465lbs). (2) Competition Deadlift 3x1-2 @ RPE 9.5 (~92.5% 1RM). If 1RM is 500lbs, working weight is ~460-465lbs. Week 9 (90% = 450lbs) felt RPE 9 for 3 reps; 460-465lbs will feel RPE 9.5 for 1-2 reps. Many lifters do 3x1 (3 singles) rather than 3x2 at this intensity—that's perfectly acceptable. Attempting a second rep when first rep was RPE 9.5 is risky (form breakdown, injury). Coach's guidance: If first rep moves with decent speed (<4sec floor-to-lockout), you MAY attempt second rep. If first rep is slow (>5sec) or any form breakdown (back rounding, hips shooting up, hitching), do NOT attempt second rep—rest and move to next set. Setup: This is the most critical part of the deadlift at 92.5%. Feet: hip-width (conventional) or wide (sumo), bar over mid-foot (look down, bar should bisect your foot). Grip: Mixed grip (one overhand, one underhand—prevents bar rolling) or hook grip (thumb wrapped by fingers—painful but secure). Use straps if grip fails, but try without first (competition doesn't allow straps). Shin position: Shins should be vertical or near-vertical when you grip bar (don't let knees drift forward over bar—pushes bar away from body). Chest up: Pull chest up toward ceiling, engage lats (imagine bending bar around shins, pull slack out of bar—bar should click against plates before you pull). Brace: Biggest breath of your life, brace core 360° (belly, sides, lower back), hold throughout rep. Execution: Push floor away with legs (initiate with leg drive, NOT by pulling with back), bar scrapes shins and thighs (stays in contact with body entire lift—if bar drifts forward, you lose leverage), hips and shoulders rise together (don't shoot hips up first—this turns deadlift into stiff-leg deadlift and strains back), lockout with glutes (squeeze glutes hard, stand tall, shoulders slightly back—don't lean back excessively or hitch). Lower with control (don't drop bar aggressively—controlled descent prevents injury). Rest 5min between sets (sit down, release belt if wearing one, sip water, mentally reset—deadlifts are as mental as physical at 92.5%). Record: weight, reps completed (1 or 2?), RPE per set, bar speed (first rep: good/moderate/slow/grind), any form breakdown (back rounding? hips shot up? hitching? bar drifted forward?), grip (did grip hold or start slipping?). This data informs Week 11's single (goal: 95-97.5% for 1 clean rep). (3) NO secondary deadlift variation. Deficit or paused deadlifts are eliminated during peaking—competition deadlift only. (4) Front Squat OR High-Bar Squat 2x5 @ RPE 6-7 (~50-55% back squat 1RM). Very light secondary squat, purely for movement pattern and blood flow. Rest 2-3min. (5) Very Light RDL 2x8 @ RPE 6 (~40-50% DL 1RM). Hamstring maintenance, extremely light. Rest 2min. (6) Cooldown 10-15min: Stretching (hamstrings, glutes, lower back—very gentle, avoid aggressive stretching when fatigued from maximal deadlifts), light walking (5-10min slow pace, flush blood through legs, reduce stiffness). Total session: 75-90min. Thursday is the most demanding day of the program during peaking phase. Expect extreme fatigue.",
        "Day 5 (Friday) — Rest (Complete Rest Non-Negotiable). Full rest after Thursday's near-maximal deadlifts. Deadlifts at 92.5% are the single most fatiguing lift in the program—grip, posterior chain, lower back, and CNS are maximally taxed. Friday rest is mandatory. Do NOT lift, condition, or do active recovery. Complete rest. If lower back is sore or tight (very common after 92.5% deadlifts): Child's pose stretch (kneel, sit back on heels, extend arms forward, hold 60-90sec—gentle lower back stretch), cat-cow stretch (hands and knees, arch/round spine slowly, 10 reps), knee-to-chest stretch (lie on back, pull knee to chest, hold 30sec per side), light heat (heating pad or hot bath—increases blood flow, reduces stiffness, apply 15-20min), avoid foam rolling directly on lower back (too much pressure on spine—roll glutes and hamstrings instead). Otherwise: Complete rest. Prioritize: Sleep 8-9 hours (lower back soreness can disrupt sleep—consider pillow between knees if side-sleeping, or pillow under knees if back-sleeping), nutrition (post-deadlift meal is critical: protein + carbs within 2hr, then regular meals hitting daily targets), hydration (deadlifts are dehydrating—drink extra water today), mental recovery (visualize Week 11's heavy single—see yourself hitting 95-97.5% confidently). Reflect: How did Thursday's deadlift(s) at 92.5% feel? Bar speed? Form? Grip? Compare to Week 9 (90%)—was the jump manageable? This informs Week 11's opener and top single attempt (conservative approach: if 92.5% was RPE 9.5 and slow, maybe attempt 95% for single; aggressive approach: if 92.5% was RPE 9 and decent speed, attempt 97.5%).",
        "Day 6 (Saturday) — Upper: Very Light Accessory Work (Maintenance Only). Focus: Minimal upper body work—light bench, back, arms purely for movement and blood flow. This is NOT training. Session: (1) Warm-up 10min: Light cardio, dynamic stretches, bar work. (2) Competition Bench Press 2x5 @ RPE 6 (~60-65% 1RM, or ~65-70% of Tuesday's 92.5%). If you benched 275lbs x 2 on Tuesday, use ~180-190lbs x 5 today. Should feel very easy—focus on bar speed and technique. Rest 2-3min. (3) Dumbbell Bench Press 2x10 @ RPE 7. Light hypertrophy, maintain movement pattern. Rest 2min. (4) Pull-Ups OR Lat Pulldown 2x8 @ RPE 7. Light back work. Rest 2min. (5) Light Cable Row 2x10-12 @ RPE 6-7. Back maintenance. Rest 90sec. (6) Optional: Very light arm work (curls, triceps extensions 2x10-12 @ RPE 6-7 if feeling fresh, otherwise skip). (7) Face Pulls 2x15-20 @ RPE 6-7 (always do these—shoulder health). (8) Cooldown 5-10min. Total session: 50-60min. This should feel like a recovery workout, not training.",
        "Day 7 (Sunday) — Rest (Complete Rest Strongly Recommended). Full rest after a brutal peaking week. You've handled 92.5% on all three competition lifts, accumulating massive neural and physical fatigue. Sunday rest allows adaptation and preparation for Week 11 (95-97.5% singles—the heaviest week before taper). Do NOT train. Optional: 10-15min very easy walk (purely for mental break), very gentle stretching (focus on mobility, no intensity). Otherwise complete rest. Prioritize: Sleep 8-9 hours (catch up if you've been short any nights—sleep is when strength adaptations occur), meal prep for Week 11 (plan pre-workout meals that you'll use on competition day—test digestion and energy), social time or hobbies (balance is critical during peaking—training is important, but so is mental health), reflection and planning (review Week 10 log: How did 92.5% feel across all three lifts? Any lifts that felt stronger/weaker than expected? Any form issues? Plan Week 11 attempts: Conservative approach: Squat 95% x 1, Bench 95% x 1, Deadlift 95% x 1. Moderate approach: Squat 95-97.5% work up to heavy single, same for bench/deadlift. Aggressive approach: Attempt 97.5-100% if 92.5% felt easy. Most lifters do moderate approach—work up to 95-97.5% single, which confirms readiness for competition without excessive fatigue). Week 10 is complete. You've practiced near-maximal loads with doubles, teaching your body to handle heavy weight under fatigue. Week 11 is the final test before taper: heavy singles at 95-97.5% to confirm PRs are within reach and dial in openers for competition. Then Week 12's taper (volume cut, openers Wednesday, compete Sunday) will leave you fresh and ready to peak. You're on track. Trust your training, eat, sleep, and prepare for Week 11's heavy singles."
      ]
    }
  }
]
