[
  {
    "name": "MMA Fight Camp — Week 1 (Base Building)",
    "weekNumber": 1,
    "phase": "Base Building",
    "overview": "Week 1 kicks off your fight camp with foundational strength work and aerobic base building. This week prioritizes building work capacity and establishing movement patterns that will carry through the entire camp. Strength sessions focus on moderate loads (70-75% 1RM) with controlled tempos to build quality movement. Conditioning emphasizes Zone 2 aerobic work to develop mitochondrial density—this aerobic base will accelerate recovery between rounds and training sessions as camp intensifies. Technical training volume is moderate (4-5 sessions) to allow focus on physical development. The week balances building a solid foundation without accumulating excessive fatigue.",
    "days": [
      "**Lower Body Power + Alactic Conditioning (60min)**\n\nStart the week fresh with explosive lower body work. Begin with 5min dynamic warm-up (leg swings, hip circles, ankle mobility). Neural activation: 3 sets × 3 reps Trap Bar Jumps—focus on maximal intent, full rest between sets (2-3min). Main strength: 4 sets × 6-8 reps Safety Bar Squat @ 70-75% 1RM, controlled tempo (3-0-1-0), rest 2min. Explosive work: 3 sets × 5 reps Kettlebell Swings (32kg), explosive hip snap, rest 90sec. Plyometrics: 3 sets × 5 reps Broad Jumps—focus on landing mechanics, rest 2min. Finish with 6 rounds × 10sec Assault Bike sprint / 50sec easy spin (alactic power development). Cool-down: 5min stretching, focus on hip flexors and hamstrings.\n\n**MMA Integration:** Schedule after light technical drilling (not sparring). Avoid heavy grappling before this session—prioritize strength & conditioning quality.",
      "**MMA Training Day — Striking Technical**\n\nFocus on striking technique, pad work, and drilling. No S&C session today—allow yesterday's lower body work to recover. This is a pure skill day. Emphasize:\n- Footwork fundamentals\n- Combination fluency (jab-cross-hook, kick setups)\n- Defensive positioning (head movement, blocking)\n- Pad rounds: 5-6 rounds × 3min with moderate intensity\n\nAvoid hard sparring. Save explosive exchanges for later in the week. Stay light on your feet—if legs feel heavy from yesterday's squats, reduce pad round volume by 1-2 rounds. Hydration and nutrition are critical for recovery. Evening: 15min easy Zone 2 cardio optional (bike or walk) to flush legs.",
      "**Upper Body Strength + Anti-Rotation Core (60min)**\n\nMid-week upper session focuses on punching power and grappling strength. Warm-up: 5min (band pull-aparts, scapular wall slides, shoulder circles). Max strength push: 4 sets × 5 reps Bench Press @ 80% 1RM, controlled descent (2sec), explosive press, rest 2-3min. Max strength pull: 4 sets × 5 reps Barbell Row @ heavy load (chest-supported or Pendlay), rest 2min. Rotational power: 3 sets × 6 reps/side Med Ball Rotational Throw (8-10lb ball, explosive against wall), rest 90sec. Anti-rotation core: 3 sets × 8 reps/side Pallof Press (cable or band, hold iso for 2sec), rest 60sec. Grip work: 3 sets × 30sec Dead Hang (weighted if bodyweight is easy), rest 90sec. Cool-down: 5min shoulder/lat stretching.\n\n**MMA Integration:** Pair with striking-focused MMA session (technical, not hard sparring). Morning S&C, evening technique is ideal. If scheduling forces same-session, do S&C first (AM), technical work later (PM).",
      "**MMA Training Day — Grappling & Conditioning**\n\nGrappling-focused session with positional sparring and light conditioning. No S&C today—full recovery day for upper body. Session structure:\n- Drilling: Takedown setups, guard passing, escapes (30min)\n- Positional sparring: 6-8 rounds × 4min (specific positions: top/bottom, guard, side control)\n- Light conditioning finisher: 5 rounds × 1min shadowboxing / 30sec rest\n\nAvoid hard, explosive takedown attempts if upper body feels fatigued from yesterday's bench and rows. Emphasize technique and flow. This is a moderate-intensity day—RPE 6-7. Evening: Foam roll shoulders, lats, and thoracic spine. Optional: 10min sauna or contrast shower for recovery.",
      "**Full Body Explosive + Fight Simulation Conditioning (60min)**\n\nEnd-of-week session integrates explosive power and fight-specific conditioning. Warm-up: 5min shadow boxing with light movement. Olympic lift: 5 sets × 3 reps Power Clean @ 70% 1RM, explosive pull, soft landing, rest 2-3min. Explosive upper: 3 sets × 5 reps Plyo Push-ups (clap or release), rest 90sec. Explosive lower: 3 sets × 5 reps Jump Squats (bodyweight or 20% bodyweight load), rest 90sec. **Fight Simulation Conditioning (primary focus):** 3 rounds × 5min work / 1min rest. Round structure: 30sec Assault Bike sprint → 30sec KB Swings → 30sec Burpees → 30sec Battle Ropes → 30sec rest, repeat 2x per round. This mimics the work-rest demands of a 5min MMA round. Finisher: 2 sets × 5 reps/side Turkish Get-Up (24-32kg KB), rest as needed. Cool-down: 5min breathwork (box breathing: 4sec in, 4sec hold, 4sec out, 4sec hold).\n\n**MMA Integration:** Schedule before light technical work or on a technique-only day. Avoid pairing with hard sparring. This session is metabolically demanding—prioritize recovery tonight.",
      "**MMA Training Day — Open Mat / Light Sparring**\n\nSaturday open mat with optional light sparring. No S&C today—full recovery from yesterday's fight simulation conditioning. Session options:\n- Flow rolling: 8-10 rounds × 5min (emphasize transitions, not explosive scrambles)\n- Light MMA sparring: 4-5 rounds × 3min (50-60% intensity, technical exchanges)\n- Drilling: Work on weak areas identified during the week\n\nChoose based on fatigue levels. If legs are heavy from yesterday's conditioning, skip sparring and focus on upper-body grappling (guard work, submissions from top). Hydration is critical—fight simulation conditioning yesterday depleted glycogen. Sip electrolytes throughout session. Evening: 20min Zone 2 cardio (easy bike or incline walk) to maintain aerobic base without excessive fatigue.",
      "**Complete Rest or Active Recovery**\n\nSunday is non-negotiable rest. Your body has accumulated 6 days of training stress (3 S&C sessions + 4-5 MMA sessions). Options:\n- **Complete rest:** Sleep in, stretch lightly, foam roll, watch film of training footage\n- **Active recovery (optional):** 20-30min easy walk, yoga, swimming (very low intensity)\n- **Recovery protocols:** Sauna (15-20min), contrast showers, massage, or stretching routine\n\nAvoid any explosive movement or hard exertion. Mental recovery is as important as physical—review this week's technical notes, visualize next week's training, or completely unplug. Nutrition: Eat at maintenance calories, prioritize protein (0.8-1g per lb bodyweight) and hydration. Sleep 8-9 hours tonight—recovery happens during sleep. Tomorrow starts Week 2 with similar structure but slightly increased loads."
    ]
  },
  {
    "name": "MMA Fight Camp — Week 4 (Fight-Specific Preparation Begins)",
    "weekNumber": 4,
    "phase": "Fight-Specific Preparation",
    "overview": "Week 4 marks the transition into fight-specific preparation. Strength work shifts toward explosive power development—loads increase slightly (85-90% 1RM) but volume decreases (3 sets vs 4) to manage fatigue and prioritize explosive intent. Conditioning shifts from aerobic base to anaerobic capacity and alactic power: you'll see 5min round intervals and 10sec sprints that directly mimic fight demands. Technical training volume peaks (6 sessions) with increased sparring intensity. This week introduces the balancing act of concurrent training: maintaining strength while developing fight-specific power and conditioning without overtraining. Auto-regulation becomes critical—if morning resting heart rate is elevated or soreness is excessive, scale back S&C volume. The goal is to arrive at sparring sessions sharp and explosive, not fatigued.",
    "days": [
      "**Lower Body Explosive + Alactic Power (55min)**\n\nReduced total time (55min vs 60min) but increased intensity. Warm-up: 5min dynamic movement (Cossack squats, hip airplanes, ankle mobility). Neural activation: 4 sets × 3 reps Box Jumps (30-36\" box)—explosive triple extension, step down, full rest (2-3min). Main strength: 3 sets × 3 reps Safety Bar Squat @ 85% 1RM, explosive concentric (zero grind), rest 3min. If bar speed slows, reduce load 5-10%. Explosive work: 4 sets × 5 reps Med Ball Slam (20-30lb ball), maximal intent, rest 90sec. Plyometrics: 3 sets × 5 reps Lateral Bounds (emphasize rapid ground contact), rest 2min. **Alactic power (increased volume):** 10 rounds × 10sec Prowler Push (heavy load) / 50sec walk back. This develops explosive bursts for takedown attempts and scrambles. Cool-down: 5min (hip flexor stretch, hamstring flossing, breathwork).\n\n**MMA Integration:** Schedule on grappling-light day. Avoid heavy takedown drilling before this session—prioritize explosive quality in S&C. Evening: Technical striking or positional grappling (no live rounds).",
      "**MMA Training Day — Technical Drilling + Conditioning**\n\nNo S&C today—pure technical and conditioning work. Morning session (if available): 45min drilling (takedown setups, submission chains, cage work). Afternoon/Evening: **Anaerobic conditioning focus.** 5min round structure (NEW this week): 5 rounds × 5min work / 1min rest. Work structure: 30sec hard effort → 30sec moderate effort, repeat 5x per round. Modalities: Rotating stations (Round 1: Rowing, Round 2: Assault Bike, Round 3: Heavy Bag Combinations, Round 4: KB Swings + Burpees, Round 5: Battle Ropes + Shadow Boxing). This directly trains the energy system for sustaining high output during 5min MMA rounds. RPE should be 8-9 during hard intervals. Recovery tonight: Contrast shower, foam roll, hydrate heavily. Sleep 8+ hours.",
      "**Upper Body Explosive + Anti-Rotation (55min)**\n\nExplosive upper focus with increased intensity. Warm-up: 5min (band face pulls, scapular push-ups, shoulder dislocates). Max strength: 3 sets × 3 reps Bench Press @ 87% 1RM, explosive press (bar should accelerate), rest 3min. Max strength pull: 3 sets × 3 reps Weighted Pull-up @ heavy load (or Barbell Row @ 85%), rest 3min. **Explosive upper (new emphasis):** 4 sets × 5 reps Med Ball Chest Pass (against wall or with partner, 10-12lb ball), maximal explosion, rest 90sec. Rotational power: 4 sets × 6 reps/side Landmine Rotation (barbell in landmine, explosive rotation), rest 90sec. Anti-rotation: 3 sets × 10 reps/side Pallof Press (increase resistance from Week 1), rest 60sec. Grip finisher: 3 sets × 45sec Farmer's Carry (heavy KB or DB), rest 90sec. Cool-down: 5min shoulder mobility and breathwork.\n\n**MMA Integration:** Pair with striking-focused MMA session. Avoid hard sparring today if possible—prioritize technical pad work and combination drilling. Explosive bench and chest passes will enhance punching power over time.",
      "**MMA Training Day — SPARRING (Hard Rounds)**\n\nThursday is primary sparring day. NO S&C session—full focus on technical performance and fight sharpness. Warm-up thoroughly (15min: shadow boxing, movement drills, dynamic stretches). Sparring structure:\n- **Striking sparring:** 5 rounds × 3min (70-80% intensity)\n- **MMA sparring (optional):** 3 rounds × 3min (60-70% intensity, focus on transitions)\n\nGoals: Test combinations learned this week, work defensive positioning, manage distance and footwork under pressure. Avoid ego sparring—this is technical sharpening, not a street fight. If you took damage (heavy shots, tweaked joints), scale back intensity or rounds. Recovery is non-negotiable tonight: Ice any sore areas, foam roll, contrast shower, high-quality meal with protein and carbs. Sleep 9 hours if possible—sparring is CNS-intensive.",
      "**Full Body Power + Fight Simulation (60min)**\n\nEnd-of-week power and conditioning session. Warm-up: 5min (dynamic movement, shadow boxing). Olympic lift: 5 sets × 3 reps Hang Snatch @ 75% 1RM, explosive pull and fast lockout, rest 3min. If technique breaks down, reduce load—this is about speed, not grinding. Explosive pairing: Superset 3 sets:\n- A1: Plyo Push-ups × 5 reps\n- A2: Jump Squats (bodyweight) × 5 reps\n- Rest 2min between supersets\n\n**Fight Simulation Conditioning (INCREASED VOLUME):** 4 rounds × 5min work / 1min rest (up from 3 rounds Week 1). Round structure: 30sec Assault Bike sprint → 30sec KB Swings → 30sec Burpees → 30sec Battle Ropes → 30sec Med Ball Slams → repeat. This round includes an extra station (slams) to increase total work. RPE 9 during hard efforts. Finisher: 2min max-effort Plank Hold. Cool-down: 10min (stretching, box breathing, mental visualization of fight scenarios).\n\n**MMA Integration:** Schedule after light technique or on a non-sparring day. This session is metabolically brutal—avoid pairing with hard training.",
      "**MMA Training Day — Sparring + Open Mat**\n\nSaturday sparring and open mat. No S&C—recovery from yesterday's fight simulation. Session structure:\n- Light warm-up drilling (15min)\n- **MMA sparring:** 5 rounds × 5min (THIS IS NEW—full round duration, 60-70% intensity)\n  - Focus: Pacing, round management, transitions between striking and grappling\n  - Goal: Simulate fight conditions without excessive damage\n- Open mat: 4-6 rounds × 5min flow rolling (optional, based on fatigue)\n\nThis is the first week with full 5min sparring rounds. Pace yourself—don't blow out in Round 1. Practice breathing between exchanges, managing position when tired, and maintaining technique under fatigue. If you're excessively sore from Friday's conditioning, reduce sparring rounds to 3-4. Evening: Epsom salt bath, foam roll entire body, review sparring footage if available. Nutrition: Refeed with carbs tonight (sweet potato, rice, fruit) to replenish glycogen.",
      "**Complete Rest**\n\nSunday is mandatory rest. This week introduced:\n- Increased strength intensity (85-90% loads)\n- 5min anaerobic conditioning rounds\n- Full 5min MMA sparring rounds\n- Higher technical volume (6 sessions)\n\nYour CNS and muscular systems need recovery. Today's options:\n- **Complete rest:** Sleep, light stretching, meditation, or complete mental break\n- **Optional active recovery:** 20min easy walk or swim (RPE 3-4, conversational pace)\n- **Recovery protocols:** Sauna, massage, or ice bath (if available)\n\nReview this week: How did sparring feel? Are combinations flowing? Any joint pain or excessive soreness? Adjust next week's volume based on recovery status. If morning resting heart rate is elevated Sunday morning (10+ bpm above baseline), plan a lighter Week 5. Nutrition: Eat at maintenance, focus on anti-inflammatory foods (fatty fish, berries, leafy greens). Sleep 9 hours tonight. Week 5 continues fight-specific prep with similar structure."
    ]
  },
  {
    "name": "MMA Fight Camp — Week 7 (Final Peak)",
    "weekNumber": 7,
    "phase": "Final Peak",
    "overview": "Week 7 is your final hard week before the fight week taper. All systems peak simultaneously: strength work is heavy but low-volume (2 sets × 3 reps @ 87-92% 1RM) for maintenance and neural sharpness, explosive work maintains quality with maximal intent, and conditioning reaches peak volume (5 rounds of fight simulation). Technical training intensity peaks—this is your last week of hard sparring. The goal is to arrive at Week 8 (taper) having demonstrated fight-readiness in all areas: power, conditioning, and technical execution. Auto-regulation is critical—if you're beat up, reduce S&C volume (skip accessories, reduce conditioning rounds). The taper will dissipate accumulated fatigue, so don't panic about soreness. Focus on quality over quantity. Mental preparation intensifies: visualize fight scenarios, review opponent footage (if available), and practice fight-week routine (warm-up protocol, weigh-in simulation if cutting weight).",
    "days": [
      "**Lower Body Power Maintenance + Alactic Peak (50min)**\n\nReduced total time (50min) but peak intensity. Warm-up: 5min dynamic movement. Neural activation: 3 sets × 3 reps Trap Bar Jumps, maximal intent, rest 3min. **Strength (HEAVY, LOW VOLUME):** 2 sets × 3 reps Safety Bar Squat @ 90% 1RM. This is the heaviest load of camp—bar should move quickly on concentric. If bar speed is slow, you're too fatigued—reduce to 87%. Rest 4-5min between sets. Explosive work: 3 sets × 3 reps Med Ball Slam (heavy ball, maximal explosion), rest 2min. **Alactic power (PEAK VOLUME):** 12 rounds × 10sec Hill Sprint (max effort) / 50sec walk down. This is the highest alactic volume of camp—develops explosive bursts for final scrambles and finish attempts. Cool-down: 5min stretching and breathwork.\n\n**MMA Integration:** Schedule on a light technical day (no sparring, no heavy grappling). Evening: Foam roll legs, contrast shower, high-quality meal. Sleep 9 hours—CNS recovery is critical after 90% squats and max-effort sprints.",
      "**MMA Training Day — Technical Refinement**\n\nNo S&C today. Focus on technical refinement and game-planning. Morning: 45min drilling (setups you'll use in the fight: specific combinations, takedown entries, submissions from your best positions). Afternoon/Evening: **Anaerobic conditioning (MODERATE VOLUME):** 4 rounds × 5min (reduced from 5 rounds to manage fatigue before Wednesday sparring). Work structure: 30sec hard / 30sec moderate, rotating modalities (Assault Bike, Rowing, Heavy Bag, KB Swings). RPE 8 during hard intervals—don't redline. Recovery: Ice any sore joints, foam roll, hydrate heavily. Review fight footage if available—study opponent's patterns, tendencies, and openings.",
      "**Upper Body Power Maintenance + Core Strength (50min)**\n\nFinal hard upper session before taper. Warm-up: 5min (band work, shoulder mobility). **Strength (HEAVY, LOW VOLUME):** 2 sets × 3 reps Bench Press @ 90% 1RM, explosive press, rest 4min. Max strength pull: 2 sets × 3 reps Weighted Pull-up @ maximal load, rest 4min. Explosive upper: 3 sets × 3 reps Med Ball Chest Pass (heavy ball, max explosion), rest 2min. Rotational power: 3 sets × 5 reps/side Landmine Rotation (explosive, heavy load), rest 90sec. **Core strength (fight-specific):** 3 sets × 5 reps/side Turkish Get-Up @ heavy KB (32-40kg), rest 2min. This builds stability under fatigue and simulates getting up from the ground in a fight. Cool-down: 5min shoulder and lat stretching.\n\n**MMA Integration:** Pair with light striking technical work (pad rounds, no hard sparring today). Save explosive energy for Saturday's final hard sparring session.",
      "**MMA Training Day — Light Technical (Pre-Sparring Rest)**\n\nNo S&C today. This is a recovery day before Saturday's final hard sparring. Light drilling only:\n- 30min: Flow through game plan sequences (combinations, setups, counters)\n- 20min: Shadowboxing and movement drills (footwork, angles, defensive positioning)\n- 10min: Breathwork and visualization\n\nNo live rounds, no heavy pad work, no explosive movements. This is mental and technical sharpening, not physical stress. Evening: Massage or foam roll entire body. Contrast shower. High-quality meal with protein and complex carbs. Sleep 9 hours—Saturday's sparring is your final test before the fight.",
      "**Full Body Explosive + Fight Simulation Peak (60min)**\n\nFinal explosive and conditioning session before taper. Warm-up: 5min shadow boxing. Olympic lift: 4 sets × 2 reps Hang Snatch @ 80% 1RM (reduced reps, maintain speed), rest 3min. Explosive pairing (REDUCED VOLUME): 2 sets:\n- A1: Plyo Push-ups × 3 reps\n- A2: Jump Squats × 3 reps\n- Rest 2min\n\n**Fight Simulation Conditioning (PEAK VOLUME):** 5 rounds × 5min work / 1min rest. Round structure: 30sec Assault Bike sprint → 30sec KB Swings → 30sec Burpees → 30sec Battle Ropes → 30sec Med Ball Slams → repeat. This is the highest conditioning volume of camp—matches championship fight duration (5×5min). RPE 9+ during hard efforts. You should feel like you're in a fight. Finisher: 2min Plank Hold (or until failure). Cool-down: 10min stretching, box breathing, mental visualization of winning the fight.\n\n**MMA Integration:** Schedule on a non-sparring day. This session is brutal—prioritize recovery tonight. Ice bath or contrast shower, high-carb meal, sleep 9 hours.",
      "**MMA Training Day — FINAL HARD SPARRING**\n\nSaturday is your final hard sparring session before the fight. NO S&C—full focus on technical sharpness and mental confidence. Warm-up: 15min (shadow boxing, movement drills, dynamic stretches). **Sparring structure:**\n- **MMA sparring:** 5 rounds × 5min (70-80% intensity)\n  - Goal: Execute game plan, test conditioning under pressure, build mental confidence\n  - Avoid taking unnecessary damage—this is sharpening, not a war\n  - If you get hurt (cut, sprained joint), STOP immediately—fight is in 8 days\n\nCoach feedback: Have your coach watch for technical leaks (defensive lapses, footwork breakdowns under fatigue, positional errors). Post-sparring: Ice any sore areas immediately. Foam roll entire body. High-protein meal with complex carbs. Review sparring footage tonight or Sunday—identify final technical adjustments for fight week. Sleep 9 hours. Tomorrow is complete rest before Week 8 taper begins.",
      "**Complete Rest — Mental & Physical Recovery**\n\nSunday is mandatory complete rest. This week you hit:\n- Heaviest loads of camp (90% 1RM)\n- Peak alactic volume (12 rounds sprints)\n- Peak conditioning volume (5×5min fight simulation)\n- Final hard sparring (5×5min rounds)\n\nYour body and mind need recovery before the taper. Today:\n- **Sleep:** Sleep in, nap if tired, aim for 9-10 hours total\n- **Recovery:** Sauna, massage, ice bath, or stretching (choose one, don't overdo recovery stress)\n- **Mental preparation:** Visualize the fight, review game plan, watch opponent footage, practice mental cues for managing adrenaline\n- **Nutrition:** Eat at maintenance or slight surplus, high protein (1g per lb bodyweight), anti-inflammatory foods\n\nReview Week 7: How did sparring go? Are you sharp and confident? Any injuries or excessive soreness? If morning resting heart rate is elevated, Week 8 taper will address this. Monday begins the taper—volume drops 70-80%, intensity stays crisp but not grinding. The hard work is done. Week 8 is about arriving at fight night fresh, confident, and explosive. Trust the process."
    ]
  }
]
